[
  {
    "title": "chocolate fudge",
    "ingredients": [],
    "directions": [
      "Line a 9-by-5-inch loaf pan with foil, leaving a 2-inch overhang on all sides.",
      "Lightly brush the foil with butter.",
      "Lightly brush the bowl of a stand mixer or another large metal bowl with butter.",
      "Add 2 tablespoons cut-up butter, the chocolate, extract and salt; set the bowl aside.",
      "Heat the half-and-half in a medium pot over medium-high heat until hot but not boiling.",
      "Stir in the sugar and corn syrup and bring to a boil, stirring constantly and scraping the bottom of the pot with a wooden spoon; boil, stirring, until the sugar is dissolved, about 3 minutes.",
      "Reduce the heat to low; run a pastry brush dipped in warm water along the sides of the pan to dissolve any sugar crystals clinging to the pan.",
      "Clip a candy thermometer to the pan.",
      "Simmer the mixture, undisturbed, until the thermometer registers 234 degrees F to 238 degrees F, 20 to 30 minutes, watching the temperature closely as cooking times may vary.",
      "(This is the \"soft-ball stage.\"",
      "To test for doneness, drop some of the mixture into cold water; you should be able to roll it into a soft ball.)",
      "Quickly pour the sugar mixture over the chocolate-butter mixture in the bowl (do not scrape the sides or bottom of the saucepan in case any sugar crystals formed).",
      "Clean the candy thermometer, then clip it to the bowl.",
      "Let the chocolate mixture cool, undisturbed, until it registers 110 degrees F to 115 degrees F, about 1 hour.",
      "(For faster cooling, set the bowl in a larger bowl of cold water.)",
      "Brush the paddle attachment or mixer beaters with butter.",
      "Beat the mixture on medium speed until just incorporated, about 1 minute.",
      "Reduce the mixer speed to low and beat until the fudge just begins to lose its sheen and hold its shape, 5 to 15 minutes.",
      "Do not overmix or the fudge will become hard.",
      "Use a buttered rubber spatula to scrape the fudge into the prepared pan and pat into an even layer; smooth the top.",
      "Press one or more toppings into the fudge, if desired (about 3/4 cup total).",
      "Let sit at room temperature for 1 hour, then score the fudge into small squares with a knife.",
      "For the best texture, let sit at least 1 more hour before slicing.",
      "Wrap leftover fudge in plastic wrap and store in an airtight container for up to 1 week at room temperature, or up to 2 weeks in the refrigerator.",
      "Bring to room temperature before serving.",
      "Toppings:",
      "Crushed sandwich cookies",
      "Crushed graham crackers",
      "White chocolate chips",
      "Sprinkles",
      "Peanut butter drizzle",
      "Mini marshmallows",
      "Photograph by James Wojcik"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "unsalted butter",
      "chocolate",
      "vanilla",
      "kosher salt",
      "sugar",
      "light corn syrup",
      "toppings",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "green bean casserole with sausage",
    "ingredients": [],
    "directions": [
      "Preheat the oven to 350 degrees F.",
      "First we are going to brown the ground sausage in a large frying pan.",
      "We are just going until you no longer see pink, as we will be baking it later.",
      "While the sausage is browning, in an 8x8 or 9x9 baking dish, mix the cream of mushroom soup with the milk (using the soup can as the measurement).",
      "Next pour in the drained green beans.",
      "This next part, I do by taste and really am not sure how much I actually use.",
      "I have made it so much I no longer measure anything out.",
      "Sprinkle the top of the beans with your favorite Italian seasonings (I am guessing I use between 1 to 2 tablespoons total).",
      "Also add the garlic.",
      "I have used minced garlic, and I have also used garlic powder or garlic salt.",
      "It just depends on what I have on hand.",
      "By this time your sausage should be finishing up cooking.",
      "If you dont see pink, you are ready to drain off the fat and pour the sausage on top of the green beans.",
      "Combine all the ingredients with the cream of mushroom soup so that everything is nicely coated.",
      "On top of the casserole, around the edges of the baking dish sprinkle the Frenchs onions.",
      "Bake for 30-45 minutes.",
      "Once you put your casserole in the oven, make your mashed potatoes.",
      "Peel and cut 6 to 8 medium-sized potatoes into roughly 1 inch cubes.",
      "Place chopped potatoes into a pot of water.",
      "Bring to a boil and let cook for 20 minutes or so until the potatoes are fork tender.",
      "Using a potato masher, mash the potatoes slightly to get them broke up.",
      "Add in the milk and butter or margarine.",
      "Continue mashing to desired consistency.",
      "When everything is ready, put a serving of mashed potatoes on the plate and cover them with the green bean casserole."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Maple Sausage",
      "Cream Of Mushroom Soup",
      "Milk",
      "Green Beans",
      "Italian Seasonings",
      "Garlic",
      "Onions",
      "Potatoes",
      "Milk",
      "Butter",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "vegetable tortellini soup",
    "ingredients": [],
    "directions": [
      "In a large saucepan or Dutch oven, cook onion and garlic in olive oil until tender, about 6 minutes.",
      "Add broth, tomatoes, salsa and basil; bring to a boil.",
      "Stir in tortellini; simmer uncovered 15 minutes.",
      "Stir in bell pepper; continue to simmer 3 to 4 minutes or until tortellini is tender.",
      "Ladle into soup bowls; sprinkle with cheese."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "onion",
      "garlic",
      "olive oil",
      "beef broth",
      "tomatoes",
      "salsa",
      "basil",
      "tortellini",
      "green bell pepper",
      "parmesan cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "snow topped peppermint cookies",
    "ingredients": [],
    "directions": [
      "Melt 1 c chocolate chips in the microwave, cool.",
      "Cream butter and sugar.",
      "Add eggs, one at a time, beat well after each.",
      "Beat in melted chocolate chips, vanilla and peppermint extract.",
      "Combine flour, baking powder and salt; gradually add to the creamed mixture.",
      "Stir in remaining chocolate chips; cover and refrigerate for 2 hours or until easy to handle.",
      "Roll into 1-inch balls then roll in confectioners' sugar.",
      "Place 2 inches apart on greased baking sheets.",
      "Bake at 350 degrees for 10-12 minutes or until edges are set and centers are almost set.",
      "Cool for 10 min before removing to wire racks."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "semi-sweet chocolate chips",
      "butter",
      "vanilla",
      "flour",
      "salt",
      "baking powder",
      "peppermint",
      "sugar",
      "eggs",
      "confectioners",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "fireside chili",
    "ingredients": [],
    "directions": [
      "Brown meats, add bacon drippings and cook 5 minutes.",
      "Add hot water, tomato puree, Tabasco, pepper, onion and garlic, simmer 30 minutes.",
      "Add rest of the ingreients and simmer slowly for 1 to 2 hours.",
      "Serve with crackers, raw onion, grated sharp Cheddar cheese and plenty of cold beer."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chili",
      "ground beef",
      "bacon",
      "water",
      "tomato puree",
      "red hot pepper sauce",
      "chili pepper",
      "onions",
      "garlic",
      "chili powder",
      "oregano",
      "cumin",
      "paprika",
      "ground",
      "cayenne pepper",
      "salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "fruit cookie pizza",
    "ingredients": [],
    "directions": [
      "Preheat oven to the recommended temperature for the recipe you are using.",
      "Spread the cookie dough on a pizza pan, spread evenly all the way to the end.",
      "Bake for the suggested amount of time for the cookie recipe used.",
      "Once the cookie (pizza) is lightly browned, pull it out and allow it to cool for 15 minutes.",
      "Spread the fruit dip on top of the cooled crust, dont be sparring, give it a good thick coat.",
      "Finally, arrange the fruit on top in any manor you'd like, be creative, make it decorative."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "sugar cookie",
      "cream cheese",
      "mixed fruit",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "walnut brittle",
    "ingredients": [],
    "directions": [
      "Shake nuts in a sieve to remove nut powder (this will make for a clearer brittle.)",
      "Line a baking sheet with nonstick pad or with an oiled sheet of foil.",
      "Heat sugar and water in a deep 2-quart heavy saucepan over moderately low heat, stirring slowly with a fork, until melted and pale golden.",
      "Cook caramel without stirring, gently swirling pan, until golden.",
      "Stir in walnuts, then immediately pour caramel onto baking sheet, tilting sheet to spread caramel as thin as possible.",
      "Cool brittle completely at room temperature.",
      "Coarsely chop enough brittle to measure 1/2 cup, then break remainder into shards for decorating cake."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "walnuts",
      "sugar",
      "water",
      "nonstick bakeware liner",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chicken & onions with sour cream gravy",
    "ingredients": [],
    "directions": [
      "dip the chicken in the butter/oil and then in the breadcrumbs and place in a pan.",
      "(note this is best done in an oven safe skillet if possible).",
      "cut the onion into wedges, dip in butter and breadcrumbs and place in pan.",
      "drizzle any remaining butter/oil and crumbs over the top.",
      "Cook in 400 degree oven for 40-60 minutes, depending on how much chicken and your oven.",
      "Once done, remove chicken and onions from skillet, leave the crumbs behind.",
      "Add sour cream to the pan and stir, scraping up the crumbs stuck on the bottom of the pan.",
      "Heat through on stovetop if needed and add salt and pepper to taste.",
      "tips: add some hot sauce if your family likes it.",
      "this gravy goes really well with rice."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chicken breasts",
      "breadcrumbs",
      "butter",
      "onion",
      "sour cream",
      "salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chicken stuffing mix recipe",
    "ingredients": [],
    "directions": [
      "Mix first 3 ingredients.",
      "Put in 9 x 13 inch pan.",
      "Combine chicken, onion, celery, salad dressing and salt.",
      "Spread on top of dressing.",
      "Save a little for top.",
      "Mix Large eggs and lowfat milk, pour over.",
      "Cover with foil and chill at least 6 hrs.",
      "Before baking, take the cream of mushroom soup and spread over stuffing.",
      "Bake at 325 degrees for 40 min.",
      "Sprinkle with 1 c. Cheddar cheese.",
      "Bake 10 min more.",
      "Cut into squares.",
      "Serves 8."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "stuffing mix",
      "butter",
      "chicken broth",
      "chicken",
      "onion",
      "celery",
      "salad dressing",
      "salt",
      "eggs",
      "milk",
      "cream of mushroom soup",
      "Cheddar cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "country dijon salad dressing",
    "ingredients": [],
    "directions": [
      "Beat mustard, juice, sugar, herbs and vinegar in large bowl with wire whisk until well blended.",
      "Add oil gradually, whisking constantly until well blended; cover.",
      "Refrigerate several hours to allow flavors to blend."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "POUPON",
      "White grape juice",
      "brown sugar",
      "parsley flakes",
      "basil",
      "red wine vinegar",
      "Extra-virgin olive oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "stewed pork ribs in white wine",
    "ingredients": [],
    "directions": [
      "Pat dry the pork with kitchen paper.",
      "Prick with your fork and sprinkle with salt and pepper.",
      "I used loin with bones in this photo.",
      "Slice the garlic.",
      "Chop the shallots or onion finely.",
      "Cut the celery and tomatoes roughly.",
      "Pour the olive oil into a frying pan and add the garlic.",
      "Once the garlic is fragrant, add the pork and brown on all sides over a medium to high heat.",
      "Once they are browned, transfer onto a plate and set aside.",
      "Next you will fry the vegetables and cook with the browned pork.",
      "You can use the same frying pan or use a different pot to stew.",
      "I usually use a pressure cooker from this point.",
      "If you use a different pot to fry the vegetables, pour some white wine from the ingredient list and deglaze the bottom of the pan you used to brown the meat, and scrape off the brown bits to add to the pot.",
      "Heat the olive oil and saute the shallots (or onion) and celery until translucent.",
      "Add the pork from Step 4 and cover with the white wine used in Step 6 and the remaining white wine.",
      "Cook off the alcohol content over a high heat.",
      "Skim off the scum and add the roughly cut tomatoes, roughly chopped dried tomatoes and herbs.",
      "Check the taste and season lightly with salt and pepper.",
      "After cooking for 5 minutes in a pressure cooker, turn off the heat and leave to cool.",
      "If you don't use a pressure cooker, simmer for about 2 hours.",
      "After the pressure is released, check the taste.",
      "Pick out the ribs and reduce the sauce, if you prefer.",
      "Serve with parsley rice, garlic rice or mashed potatoes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "loin",
      "Salt",
      "clove Garlic",
      "Shallots",
      "stalks Celery",
      "Tomatoes",
      "White wine",
      "tomatoes",
      "Parsley",
      "Thyme",
      "Oregano",
      "Bay leaves",
      "Olive oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cumin-flavored salt",
    "ingredients": [],
    "directions": [
      "Toast cumin seeds in a dry skillet over medium-high heat until fragrant and lightly colored, about 1 minute.",
      "Grind very coarsely in a mortar or spice mill.",
      "Combine in a bowl with salt and stir together.",
      "Add red pepper flakes or cayenne, if using."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "cumin seeds",
      "medium-coarse",
      "red pepper",
      "cayenne",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "hefty-defty roly-poly weebles wobbles but they don't fall down burritos",
    "ingredients": [],
    "directions": [
      "In a large skillet over medium-high heat, cook the ground beef until brown; drain excess fat.",
      "Reduce the heat to medium and add the tomatoes, chili powder, garlic and cumin.",
      "Cook for 2 minutes, blending well.",
      "Preheat oven to 375F.",
      "Fill each tortilla with a layer of refried beans, a sprinkling of green chili peppers, a heaping tablespoon of tomato sauce and a small portion of ground beef.",
      "Roll up the tortillas, burrito-style, and place seam side down in a 13x9x2-inch baking dish (or place them in freezer bags and squeeze out excess air before sealing).",
      "When all the tortillas that you plan to cook are in the baking dish, sprinkle them liberally with Monterey Jack cheese.",
      "Bake for 20 minutes, or until the cheese is bubbly.",
      "Serve immediately with shredded lettuce, mashed avocados, and sour cream."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "lean ground beef",
      "tomatoes",
      "garlic",
      "chili powder",
      "cumin",
      "beans",
      "green chilies",
      "salt",
      "flour tortillas",
      "shredded monterey jack cheese",
      "head lettuce",
      "avocados",
      "sour cream",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "loozianna cookin sauce",
    "ingredients": [],
    "directions": [
      "Mix all ingredients.",
      "Simmer 20 minutes in small saucepan.",
      "Let mix stand 15-20 minutes to blend flavors."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "ketchup",
      "cider vinegar",
      "water",
      "brown sugar",
      "Worcestershire sauce",
      "ground black pepper",
      "kosher salt",
      "lemon juice",
      "mustard",
      "gumbo file",
      "hot pepper",
      "jalapeno juice",
      "red pepper",
      "cayenne pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "loin of veal with truffle sauce",
    "ingredients": [],
    "directions": [
      "Chop mushrooms and cook with other vegetables and veal.",
      "Soak truffles in 1/4 cup cognac for 1 to 2 hours, serve with main dish."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "vegetable shortening",
      "veal loin",
      "butter",
      "onions",
      "mushrooms",
      "celery",
      "tomatoes",
      "chicken broth",
      "salt",
      "black pepper",
      "marjoram",
      "truffles",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "great-grandmother blanche's waffles",
    "ingredients": [],
    "directions": [
      "Using whisk or whisk attachment for mixer, beat egg whites until they form stiff, white peaks and set aside.",
      "Shift together all dry ingredients.",
      "In separate bowl beat egg yolks and add milk.",
      "Using paddle attachment for mix or by hand, mix together egg whites, dry ingredients and yolk/milk mixture.",
      "Once completely mixed, cook in waffle iron per manufacturers directions."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "flour",
      "baking powder",
      "salt",
      "sugar",
      "eggs",
      "milk",
      "butter",
      "cinnamon",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "crab & shrimp plate",
    "ingredients": [],
    "directions": [
      "Mix together cream cheese, milk, & Worcestershire sauce.",
      "Spread over the bottom of a plate that has a rim.",
      "Mix chili sauce & horseradish.",
      "Spread over cream cheese mixture.",
      "Top with shrimp & crab.",
      "Sprinkle with chopped parsley, if desired.",
      "Serve with crackers."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "cream cheese",
      "milk",
      "Worcestershire sauce",
      "chili sauce",
      "horseradish",
      "shrimp",
      "crab",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "mediterranean baked lobster with olive crumbs",
    "ingredients": [],
    "directions": [
      "Preheat the oven to 450.",
      "With the back of a large knife or with a mallet, crack the claws and the knuckles all over.",
      "Rub the exposed lobster meat with 1 tablespoon of the olive oil.",
      "In a medium bowl, toss the bread with the parsley, olives, lemon juice, vinegar, lemon zest, the reserved tomalley and the remaining 1/4 cup of olive oil.",
      "Set the split lobsters, cut side up, on a large baking sheet.",
      "Season with salt and pepper and spread the stuffing over the bodies and tails, mounding it generously.",
      "Bake in the upper third of the oven for about 15 minutes, or until the stuffing is crusty and the meat pulls away from the shell.",
      "Serve at once with lemon wedges."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "live lobsters",
      "extra-virgin olive oil",
      "bread",
      "parsley",
      "Nicoise",
      "lemon juice",
      "balsamic",
      "lemon zest",
      "Salt",
      "Lemon wedges",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "shrimp in chili sauce",
    "ingredients": [],
    "directions": [
      "Peel the shrimp, remove the legs and tail, and devein.",
      "Sprinkle the shrimp with 1 teaspoon of salt, and rub the salt in well until the surface of the shrimp gets slimy.",
      "Add katakuriko and water and keep on rubbing the shrimp.",
      "Wash the katakuriko and salt, and pat the shrimp dry.",
      "Add the egg white to the shrimp and massage it in.",
      "Add 1 teaspoon of katakuriko, and mix until it has dissolved and there's no flouriness.",
      "Put in 1 tablespoon of oil and mix.",
      "Refrigerate to let the flavors meld.",
      "Finely chop the Japanese leek, garlic and ginger.",
      "Combine the sauce ingredients.",
      "Take the shrimp out of the refrigerator before they're cooked so that they can come back to room temperature.",
      "Slowly fry them in about 140C oil one by one, until they are about 70% cooked.",
      "Set a pan or wok over low heat, add 2 tablespoons of oil and stir fry the doubanjiang.",
      "Add the combined flavoring ingredients, leek, garlic and ginger.",
      "Pour the soup stock and Shaoxing wine in along the sides of the pan.",
      "When the pan comes to a boil, add the shrimp.",
      "When the pan comes back to a boil, turn the heat down and mix in the katakuriko and water to thicken the sauce.",
      "When the sauce is as thick as you want it to be, add 1 tablespoon of sesame oil plus 1 tablespoon of vinegar to finish.",
      "Mix everything up lightly.",
      "Transfer to a serving plate and garnish with chopped green onion.",
      "Boil the shrimp shells to extract a delicious stock from them before discarding them.",
      "Use the stock to make delicious miso soup."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Shrimp",
      "Doubanjiang",
      "garlic",
      "thumtip's worth",
      "Chicken bone soup",
      "Shaoxing wine",
      "Vinegar",
      "water",
      "Sesame oil",
      "Green onions",
      "Oil",
      "Sugar",
      "Ketchup",
      "Soy sauce",
      "Pepper",
      "Salt",
      "water",
      "Egg",
      "Katakuriko",
      "Oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "duck two ways, fast and slow",
    "ingredients": [],
    "directions": [
      "Rinse the duck, pat dry, and remove the thighs and legs (see Know-how, page 157).",
      "Remove the meat from the breast by cutting down the center and along the rib cage on each side of the breastbone with a sharp knife.",
      "Discard the carcass or reserve for broth.",
      "Trim the excess fat from the legs and breast.",
      "Score the skin on the legs and breast with a sharp knife, being careful not to cut through to the meat.",
      "Place the legs and breasts in a dish and season with 1 teaspoon of the salt, 1/2 teaspoon of the pepper, 1 1/2 teaspoons of the chopped rosemary, and 1 1/2 teaspoons of the thyme.",
      "Combine the red wine, vinegar, remaining 1 1/2 teaspoons rosemary, and remaining 1 1/2 teaspoons thyme in a shallow dish and stir to mix.",
      "Pour the mixture over the duck and turn several times to coat on both sides with the marinade.",
      "Cover and refrigerate for several hours or overnight.",
      "To cook the legs, preheat the oven to 325F.",
      "Heat a dry cast-iron or other ovenproof skillet over medium-high heat to just before the smoking point (see Know-how).",
      "Remove the duck legs from the marinade, reserving the marinade, and saute them, skin side down to start, for 4 to 5 minutes per side, until golden brown.",
      "Transfer to a plate and set aside.",
      "Add the carrots and shallots to the same skillet with the duck fat, reduce the heat to medium, and cook and stir for about 5 minutes, until the vegetables are light brown around the edges.",
      "Add the garlic and cook and stir for 1 minute longer.",
      "Set the duck legs, skin side up, on top of the vegetables in the same skillet and add 1/2 cup of the marinade and 1 cup of the broth, enough to submerge the legs about three-quarters of the way up, adding more broth if needed; the top part of the skin should not be covered.",
      "Add the bay leaves, cover, and roast in the oven for 2 to 2 1/2 hours, until the legs are fork-tender (see Know-how, page 172).",
      "Remove from the oven and skim the fat from the top of the liquid.",
      "To cook the breast, heat a separate dry cast-iron or heavy-bottomed skillet over medium heat to just before the smoking point.",
      "Season the breast with the remaining 1 teaspoon salt and 1/2 teaspoon pepper and saute, skin side down, until the skin is golden brown and crispy, about 8 minutes.",
      "Flip the breast, pour off some of the fat if necessary, and continue to cook for another 5 to 6 minutes for medium doneness.",
      "Remove from the skillet and let rest, loosely covered, for about 5 minutes before slicing.",
      "To serve, place a few slices of breast, a leg or thigh, and vegetables on each plate.",
      "Spoon the cooking liquid over and around the duck and vegetables and serve warm.",
      "We often make two meals out of this dish by cooking the breast one night and letting the legs marinate overnight or for several days before cooking.",
      "Or, do all your cooking at one time, eat the breast the first night, and reheat the legs the next night.",
      "Nine times out of ten, when a recipe calls for alcohol, the alcohol is there to add extra flavorso omitting it will change the flavor profile slightly, but it certainly wont make or break the dish.",
      "If you prefer not to use alcohol in your cooking, try compensating by adding a splash of fruit juice, balsamic or white wine vinegar, or vegetable or chicken broth instead.",
      "For sweets, you can use flavorings like pure vanilla extract, lemon zest and juice, orange zest and juice, or strongly brewed coffee, depending on what will complement the other flavors in the dessert.",
      "The bottom line: dont stress, and have fun coming up with alternative seasonings.",
      "Whenever a recipe calls for heating an unoiled skillet or pan to just before the smoking point, place the skillet over medium-high heat for about 2 minutes, just until you see the first small wisps of smoke starting to curl off the surface.",
      "Cast iron works best for this level of heat."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "duck",
      "salt",
      "freshly ground black pepper",
      "fresh rosemary",
      "fresh thyme",
      "red wine",
      "balsamic vinegar",
      "carrots",
      "shallots",
      "garlic",
      "chicken broth",
      "bay leaves",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "dilly casserole bread",
    "ingredients": [],
    "directions": [
      "Heat cottage cheese to lukewarm.",
      "Soften yeast in water.",
      "Combine in mixing bowl cottage cheese, sugar, onion, butter, dill seed, salt, soda, egg and softened yeast.",
      "Add flour to form a stiff dough, beating well after each addition.",
      "(If using the mixer, start at low speed.)",
      "Cover.",
      "Let rise in a warm place (85 - 90 degrees) until light and doubled in size, 50-60 minutes.",
      "Stir down dough.",
      "Turn into well-greased 8 inch round (1 1/2 quart) casserole.",
      "Let rise in warm place until light 30 - 40 minutes.",
      "BAKE 350 degrees for 40-50 minutes until golden brown.",
      "Brush with soft butter and sprinkle with salt.",
      "* This can be made the day before.",
      "If so, slice almost through after cooling and wrap in foil.",
      "Warm in the oven before serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "yeast",
      "water",
      "cream-style cottage cheese",
      "sugar",
      "onion",
      "butter",
      "dill seeds",
      "salt",
      "baking soda",
      "egg",
      "flour",
      "butter",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "zesty mashed potatoes",
    "ingredients": [],
    "directions": [
      "Place potatoes in large pot, and cover with salted cold water.",
      "Bring to boil, reduce heat to medium low, and simmer 18 minutes, or until tender.",
      "Just before potatoes are done, bring soymilk just to a simmer in small saucepan over medium heat.",
      "Drain potatoes well in a colander, then return to pot along with 3/4 cup soymilk, horseradish, if using, and oil.",
      "Mash with potato masher until combined well.",
      "Season with salt and pepper, and add remaining soymilk, if necessary.",
      "Serve immediately."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "gold",
      "soymilk",
      "horseradish",
      "corn",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "scallion, mushroom, and shrimp custards",
    "ingredients": [],
    "directions": [
      "In a bowl with a fork beat eggs until combined well.",
      "Skim any fat from broth and add broth with mirin, soy sauce, and zest to eggs, stirring to combine well.",
      "Pour custard through a fine sieve into another bowl.",
      "Peel shrimp and devein if desired.",
      "Diagonally cut white and pale-green parts of scallion into thin slices and thinly slice mushroom.",
      "Divide shrimp, scallion, mushroom, and custard among four 1/2-cup custard cups or ramekins and cover each tightly with foil.",
      "Arrange cups or ramekins in a steamer over boiling water and steam custards, covered, over high heat 2 minutes.",
      "Reduce heat to moderate and steam custards, covered, until set, about 10 minutes more.",
      "Serve custards immediately."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "eggs",
      "chicken broth",
      "mirin",
      "soy sauce",
      "freshly grated lemon zest",
      "shrimp",
      "scallion",
      "mushroom",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "party pretzels",
    "ingredients": [],
    "directions": [
      "Note youll also need a 1-gallon size zip-top bag.",
      "Pour pretzels into the bag.",
      "Pour the bottle of popcorn oil and seasonings over the top and seal the bag.",
      "Shake bag to mix.",
      "This is better if it has time to marinate in the oil mixture for a few hours to a few days.",
      "We make this any time we want something to bring to a party that is simple but equally delicious.",
      "These pretzels are always a big hit, and you really cant go wrong!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Pretzels",
      "fluid Orville Redenbachers",
      "Mix",
      "Garlic",
      "Dill",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "gorgonzola cream sauce",
    "ingredients": [],
    "directions": [
      "1.",
      "In a medium pot, melt butter.",
      "2.",
      "Add flour, milk and cheese.",
      "Stir until cheese is melted and mixture is creamy.",
      "3.",
      "Add salt, pepper and crushed red pepper.",
      "4.",
      "Serve warm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Butter",
      "Flour",
      "Milk",
      "Gorgonzola Crumbles",
      "Salt",
      "Pepper",
      "Red Pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "new mexicali green chile-cheese kugel",
    "ingredients": [],
    "directions": [
      "Preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish and set aside.",
      "Bring a large pot of salted water to a boil.",
      "Add the noodles and cook until softened but not cooked through, 3 to 4 minutes; drain and transfer to a large bowl.",
      "Meanwhile, whisk the eggs and egg whites in a medium bowl until well combined.",
      "One at a time, whisk in 3/4 teaspoon salt, the chiles, lemon juice and melted butter.",
      "Stir in half of the artichoke hearts and 2 cups grated cheese.",
      "Pour the egg mixture over the noodles and mix well with your hands.",
      "Transfer the noodle mixture to the prepared baking dish.",
      "Top with the remaining artichoke hearts and 1 cup grated cheese.",
      "Bake until golden brown, about 1 hour.",
      "Let cool at least 30 minutes before serving.",
      "Photograph by Con Poulos"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "unsalted butter",
      "Kosher salt",
      "egg noodles",
      "eggs",
      "green chiles",
      "lemon juice",
      "water",
      "grated sharp white",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pinwheels",
    "ingredients": [],
    "directions": [
      "Mix the cream cheese and dressing until smooth.",
      "Spread on the tortillas.",
      "Sprinkle the peppers and olives over the cream cheese mixture.",
      "Roll up the tortilla tightly and then slice into desired size.",
      "I usually slice into about a 1 inch piece.",
      "Plate and chill."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Cream Cheese At",
      "Dressing",
      "Flour Tortillas",
      "Peppers",
      "Black Olives",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "blackberry upside down cake recipe",
    "ingredients": [],
    "directions": [
      "HEAT oven to 350 degrees.",
      "Heat margarine in round pan, 9x1-1/2 inches, or possibly square pan, 8x8x2 inches, in oven till melted.",
      "Sprinkle 1/4 c. sugar proportionately over melted margarine.",
      "Arrange Blackberries with open ends up over sugar mix; sprinkle with almonds.",
      "BEAT remaining ingredients except whipped cream in medium bowl on low speed 30 seconds, scraping bowl constantly.",
      "Beat on medium speed 4 min, scraping bowl occasionally.",
      "Pour batter over Blackberries.",
      "BAKE 35 to 40 min or possibly till toothpick inserted in center comes out clean.",
      "Immediately invert pan onto heatproof serving plate; leave pan over cake a few min.",
      "Remove pan.",
      "Let cake stand at least 10 min before serving.",
      "Serve hot with whipped cream.",
      "9 servings.",
      "Pear Upside-down Cake: Substitute packed brown sugar for the sugar and 1 large pear, thinly sliced, for the Blackberries.",
      "Substitute minced pecans for the almonds.",
      "Increase vanilla to 1 tsp.",
      "; omit almond extract.",
      "Add in 1/2 tsp.",
      "grnd mace or possibly cinnamon with the vanilla."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "margarine",
      "Sugar",
      "Blackberries",
      "almonds",
      "Bisquick original baking mix",
      "Sugar",
      "milk",
      "Vegetable oil",
      "Vanilla",
      "Egg",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "easy chocolate-dipped peanut butter cookies",
    "ingredients": [],
    "directions": [
      "Heat oven to 325F.",
      "Mix peanut butter, sugar and egg until blended.",
      "Refrigerate 30 min.",
      "Roll peanut butter mixture into 18 (1-1/2 inch) balls.",
      "Place, 2 inches apart, on baking sheet.",
      "Flatten each ball, in criss-cross pattern, with fork.",
      "Bake 18 to 20 min.",
      "or until lightly browned.",
      "Cool 5 min.",
      "Remove from baking sheets to wire racks; cool completely.",
      "Melt chocolate as directed on package.",
      "Dip half of each cookie, 1 at a time, into chocolate; gently shake off excess chocolate, then dip cookie in nuts.",
      "Place on parchment-covered baking sheet.",
      "Refrigerate until chocolate is firm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Butter",
      "sugar",
      "egg",
      "Chocolate",
      "peanuts",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "curried scallops with spinach",
    "ingredients": [],
    "directions": [
      "In a large frying pan, melt the butter over moderately low heat.",
      "Add the onion and salt and cook, stirring occasionally, until the onion starts to soften, about 3 minutes.",
      "Stir in the curry powder and cook for 1 minute.",
      "Transfer the onion mixture to a blender and add the tomato paste, broth, and cream.",
      "Puree until smooth.",
      "Return the sauce to the pan.",
      "Bring the curry sauce just to a simmer.",
      "Stir in the spinach and scallops.",
      "Simmer, covered, until the scallops are just done, 5 to 7 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butter",
      "onion",
      "salt",
      "curry powder",
      "tomato paste",
      "chicken broth",
      "light cream",
      "shredded spinach",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "taco dip",
    "ingredients": [],
    "directions": [
      "Brown hamburger over medium heat, drain.",
      "Add beans, relish and taco seasoning mix.",
      "Simmer 10 minutes.",
      "Put the mixture in a fondue or crock pot set on warm or low setting; top with cheese and onions.",
      "Serve with tortilla chips or Fritos."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Hamburger",
      "Beans",
      "Mix",
      "Cheddar Cheese",
      "Green Onions",
      "Tortilla Chips",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "candances alligater swamp drink",
    "ingredients": [],
    "directions": [
      "Blend spinach, banana, applesauce and ice together for 3 minutes until smooth."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "spinach leaves",
      "banana",
      "applesauce",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "crunchy fruit and turkey salad (4 points)",
    "ingredients": [],
    "directions": [
      "You can find smoked turkey at most deli counters.",
      "Ask the service person to cut a single piece at the desired thickness.",
      "If they do not have smoked turkey try smoked chicken breast or regular turkey breast.",
      "Combine all salad components except for the lettuce in a large bowl.",
      "Combine all ingredients for the dressing until well mixed.",
      "(It takes a bit to get the preserves to melt into the yogurt).",
      "Fold dressing into the salad and serve over red leaf lettuce.",
      "For an additional point per serving garnish the salad with a tablespoon of slivered almonds.",
      "Enjoy."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "turkey",
      "jicama",
      "carrot",
      "celery",
      "scallions",
      "granny smith apple",
      "red seedless grapes",
      "golden raisin",
      "red leaf lettuce",
      "yogurt",
      "apricot preserves",
      "lemon juice",
      "mustard",
      "almonds",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "2smile fruit smoothie",
    "ingredients": [],
    "directions": [
      "blend all together..enjoy!",
      "you can use any type of fruit mixture...this is what had."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "orange juice",
      "papaya",
      "frozen raspberries",
      "banana",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "taco salad",
    "ingredients": [],
    "directions": [
      "Brown ground beef, drain and cool to room temperature.",
      "Rinse and drain kidney beans; chop lettuce and tomatoes and crush chips.",
      "Mix together-add dressing just before serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "lean ground beef",
      "red kidney",
      "shredded lettuce",
      "tomatoes",
      "grated cheese",
      "tortilla chips",
      "dressing",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "stuffed portobello mushroom with worcestershire sauce",
    "ingredients": [],
    "directions": [
      "Preheat oven to 375 degrees F.",
      "Remove and discard all of the stems from the Portobello mushrooms and place in a baking dish.",
      "In a separate bowl, combine all of the remaining ingredients and mix well.",
      "Place a large spoonful of the mixture on top of each mushroom.",
      "Place in oven and bake for 20 minutes.",
      "Serve on a bed of lettuce or on a platter and drizzle the Worcestershire sauce around mushrooms."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "mushrooms",
      "olive oil",
      "bell pepper",
      "red onion",
      "zucchini",
      "yellow squash",
      "Worcestershire sauce",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "quick mac & cheese without milk",
    "ingredients": [],
    "directions": [
      "Prepare boiled pasta",
      "Lined a saucepan and melt better.",
      "Mix corn flour with water and add well in the saucepan",
      "Add cheddar cheese and mozzarella cheese",
      "Season with salt and pepper.",
      "Let it cook for medium heat 5 minutes.",
      "Serve with bacon if you have"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "water",
      "flour",
      "pasta",
      "Butter",
      "Salt",
      "Pepper",
      "Cheddar cheese",
      "Mozzarella cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chicken and mushroom",
    "ingredients": [],
    "directions": [
      "In a large skillet, brown chicken breast.",
      "Remove from pan.",
      ".",
      "Saute onion, mushrooms, and fresh rosemary until mushrooms are tender.",
      "Do not add salt: this will make the mushrooms tough.",
      "Pepper to taste.",
      "Add browned chicken back to pan.",
      "In a separate bowl wisk soup, broth, and garlic powder until smooth.",
      "Add to pan and head to boiling.",
      "Reduce heat and simmer for 15-20 minutes until chicken is cooked through and tender.",
      "Serve over rice or egg noodles."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chicken breasts",
      "onion",
      "mushrooms",
      "rosemary",
      "pepper",
      "cream of celery soup",
      "beef broth",
      "garlic",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "fresh tomato salad with feta",
    "ingredients": [],
    "directions": [
      "Arrange tomato and onion slices on a small, deep serving platter.",
      "Sprinkle with a layer of feta cheese and olives.",
      "In a small bowl, whisk together oil, vinegar, parsley, basil, salt and pepper.",
      "Pour dressing over salad and serve."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "tomatoes",
      "sweet onion",
      "feta cheese",
      "pimiento",
      "olive oil",
      "red wine vinegar",
      "parsley",
      "basil",
      "salt",
      "black pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "smooth peanut butter dip",
    "ingredients": [],
    "directions": [
      "Mix all the ingredients together in a small bowl until it's well combined.",
      "You can chop up some fruit to dip like bananas, apples, or strawberries."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "peanut butter",
      "topping",
      "ground cinnamon",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "our best lasagna",
    "ingredients": [],
    "directions": [
      "Cook and stir onion and garlic in olive oil in 2-quart saucepan until tender.",
      "Add beef and sausage.",
      "Brown meat; drain.",
      "Stir in tomatoes, basil and oregano.",
      "Cover.",
      "Simmer 30 minutes.",
      "Reserve 1/2 cup of the meat sauce.",
      "Mix ricotta cheese, 1/2 cup of the Parmesan cheese, eggs and parsley in medium bowl.",
      "Layer 1/2 of the noodles, remaining meat sauce and cheese mixture in 13x9-inch baking dish; repeat layers.",
      "Top with mozzarella cheese and reserved 1/2 cup meat sauce.",
      "Bake at 350F for 30 to 35 minutes or until thoroughly heated.",
      "Let stand 10 minutes before serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "onion",
      "garlic",
      "olive oil",
      "lean ground beef",
      "Italian sausage",
      "tomatoes",
      "basil",
      "oregano",
      "lasagna noodles",
      "'S Ricotta Cheese",
      "Parmesan Cheese",
      "eggs",
      "fresh parsley",
      "Mozzarella Cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "lemon poppy pound cake",
    "ingredients": [],
    "directions": [
      "Preheat oven 350 degrees F.",
      "Grease (or spray) and flour 10-inch bundt or tube pan.",
      "Cream butter and sugar until fluffy.",
      "Add eggs 1 at a time beating well after each addition.",
      "Sift together dry ingredients.",
      "Add all at once to butter mixture.",
      "Blend just until smooth.",
      "Add sour cream, lemon rind, and poppy seeds.",
      "Blend just until smooth.",
      "Bake for approximately 1 hour.",
      "Let cool in pan before removing."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butter",
      "sugar",
      "eggs",
      "flour",
      "baking powder",
      "baking soda",
      "salt",
      "sour cream",
      "lemons",
      "poppy seeds",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "steamer clam chowder",
    "ingredients": [],
    "directions": [
      "1.",
      "Fill two large pots (or two sinks) with cold water.",
      "Place the clams in one pot of water, discarding any dead ones or clams with cracked shells.",
      "Gently move them around in the water and let them soak for a few minutes, then lift them out and place them in the other pot of cold water.",
      "Rinse the first pot and fill it again.",
      "Move the clams around again, then transfer them back to the clean pot.",
      "Continue to switch the clams back and forth, letting them soak for a few minutes each time, and then lifting them out of the pot, until the water remains crystal clear.",
      "The process should take four or five soakings.",
      "2.",
      "Put the 2 cups water in an 8-quart pot, cover, and bring to a rolling boil.",
      "Quickly but gently place the clams in the pot and cover again.",
      "After 4 minutes, remove the lid and quickly stir the clams with a wooden spoon, trying to lift some of the clams from the bottom to the top so they will cook evenly but be gentle, the shells are very brittle and crack easily.",
      "Cover and continue to steam for another 4 to 5 minutes.",
      "(The broth will most likely overflow just as the clams have finished cooking.)",
      "All the clams should be open; if not, steam them a minute or two longer.",
      "Remove the clams and strain the broth; you should have 4 cups.",
      "3.",
      "When the clams are cool, remove them from the shells and cut off the siphons, as well as the protective skin that covers each siphon, and discard.",
      "(You should have about 1 pound of clam meat.)",
      "Cover and refrigerate until later.",
      "4.",
      "Heat a 4- to 6-quart heavy pot over low heat and add the diced salt pork.",
      "Once it has rendered a few tablespoons of fat, increase the heat to medium and cook until the pork is crisp and golden brown.",
      "With a slotted spoon, transfer the cracklings to a small ovenproof dish, leaving the fat in the pot, and reserve until later.",
      "5.",
      "Add the butter, onion, celery, thyme, and bay leaves to the pot and saute, stirring occasionally with a wooden spoon, for about 10 minutes, until the vegetables are softened but not browned.",
      "6.",
      "Add the potatoes and the reserved clam broth.",
      "The broth should just barely cover the potatoes; if it doesn't, add enough water to cover them.",
      "Turn up the heat and bring to a boil, cover, and cook the potatoes vigorously for about 10 minutes, or until they are soft on the outside but still firm in the center.",
      "If the broth hasn't thickened lightly, smash a few potatoes against the side of the pot and cook a minute or two longer to release the starch.",
      "7.",
      "Remove the pot from the heat.",
      "Stir in the clams and the cream and season to taste with black pepper and possibly a pinch of salt (the saltiness of steamers varies).",
      "If you are not serving the chowder within the hour, let it cool a bit, then refrigerate; cover the chowder after it has chilled completely.",
      "Otherwise, let it sit at room temperature for up to an hour, allowing the flavors to meld.",
      "8.",
      "When ready to serve, reheat the chowder over low heat; don't let it boil.",
      "Try not to stir too often, because you don't want to break open the clam bellies.",
      "Warm the cracklings in a low oven (200F) for a few minutes.",
      "9.",
      "Ladle the chowder into cups or bowls, making sure that the steamers, onions, and potatoes are evenly divided.",
      "Scatter the cracklings over the individual servings and sprinkle with the chopped parsley and minced chives."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "steamers",
      "water",
      "salt pork",
      "unsalted butter",
      "onion",
      "stalks celery",
      "thyme",
      "bay leaves",
      "Gold",
      "heavy cream",
      "Freshly ground black pepper",
      "Kosher",
      "fresh Italian parsley",
      "fresh chives",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "apple bread",
    "ingredients": [],
    "directions": [
      "Heat oven to 350 degrees, and grease and flour an 8- by 5-inch loaf pan.",
      "Cream shortening and sugar together until fluffy; beat in eggs.",
      "Sift together flour, baking powder, soda and salt; gradually add to egg mixture, alternating with portions of the grated apple.",
      "Stir in lemon peel and walnuts.",
      "The batter will be stiff.",
      "Spoon into prepared pan and bake for 50 to 60 minutes, until toothpick inserted in middle comes out clean and top is nicely browned.",
      "Cool thoroughly; do not slice until cold."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "shortening",
      "sugar",
      "eggs",
      "flour",
      "baking powder",
      "baking soda",
      "salt",
      "peeled apples",
      "lemon peel",
      "walnuts",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "spinach and fontina cheese tartlets",
    "ingredients": [],
    "directions": [
      "Preheat oven to 350F (180C).",
      "Begin sauteing the spinach in olive oil.",
      "Season with salt and pepper.",
      "Add the shallot.",
      "When almost done add the garlic.",
      "Remove from heat and set aside.",
      "With a 2 1/2 inch round biscuit or cookie cutter, cut out 24 discs from the pie crusts.",
      "Lightly grease a 24 cup mini-muffin pan.",
      "Line each muffin cup with one of the pieces of dough.",
      "Evenly distribute the spinach into the dough-lined muffin cups, tamping it down as you do so.",
      "Mix the eggs and cream with some salt and pepper and beat.",
      "Pour about a teaspoon of the egg mixture into each cup.",
      "Do not overfill.",
      "You will probably have some egg mixture left over.",
      "Top each one with a little cheese and bake for 12 to 15 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "baby spinach",
      "olive oil",
      "shallots",
      "garlic",
      "eggs",
      "cream heavy",
      "fontina cheese",
      "salt",
      "black pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "milk chocolate crepe terrine recipe",
    "ingredients": [],
    "directions": [
      "To make the batter, beat the eggs well, then add the vanilla sugar and flour.",
      "Gradually stir in the milk and 200 ml / 7 fl oz (scant 1 cup) water.",
      "Finally, stir in the melted butter and the sunflower oil.",
      "To make the chocolate sauce, put the chocolate, cream, butter, cinnamon and ginger into a heatproof bowl set over a pan of barely simmering water.",
      "Heat, stirring occasionally, until the chocolate has melted and the mixture has blended together.",
      "Keep warm.",
      "Cook the crepes in a non-stick pan (skillet), making sure that they are very thin.",
      "Set aside in a warm place.",
      "When they are all cooked, brush them with the chocolate mixture and stack them on top of each other.",
      "Serve warm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "eggs",
      "vanilla sugar",
      "flour",
      "milk",
      "butter",
      "sunflower oil",
      "milk chocolate",
      "cream",
      "butter",
      "ground cinnamon",
      "ground ginger",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "warm marinated olives",
    "ingredients": [],
    "directions": [
      "In a large saucepan, combine the olives with the pearl onions, garlic, thyme and tarragon.",
      "Add the olive oil and bring to a simmer.",
      "Cook over moderately low heat until the onions and garlic are tender, about 15 minutes.",
      "Discard the herb sprigs.",
      "Using a slotted spoon, transfer the olives, onions and garlic to a bowl.",
      "Let cool slightly and serve warm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "mixed olives",
      "pearl onions",
      "garlic",
      "thyme",
      "tarragon sprigs",
      "extra-virgin olive oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "southwest smoothie",
    "ingredients": [],
    "directions": [
      "Place all ingredients in food processor workbowl fitted with steel blade or in blender container; cover and process on high speed until smooth.",
      "Strain if using mango."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "banana",
      "mango",
      "milk",
      "honey",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "bacon-balsamic vinaigrette",
    "ingredients": [],
    "directions": [
      "In a medium skillet, toast the pine nuts over moderate heat until browned, about 3 minutes.",
      "Transfer to a plate to cool.",
      "Add the bacon to the skillet, cover with cold water and add 1 teaspoon of salt.",
      "Bring to a boil, then drain and pat dry.",
      "Heat the olive oil in the skillet.",
      "Add the bacon and cook until crisp.",
      "Transfer the bacon to a plate.",
      "Whisk the vinegar into the fat in the skillet and season with salt and pepper.",
      "Add the pine nuts and bacon just before serving the dressing hot or warm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "pine nuts",
      "bacon",
      "Salt",
      "extra-virgin olive oil",
      "balsamic vinegar",
      "Freshly ground pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cobb salad pitas",
    "ingredients": [],
    "directions": [
      "In a bowl whisk together mustard, vinegar, and salt and pepper to taste and add oil in a stream, whisking until emulsified.",
      "Peel, pit, and finely chop avocado and add to dressing.",
      "Add chicken, tomato, bacon, and cheese and toss lightly.",
      "Divide romaine among pita halves.",
      "Divide chicken mixture among pita halves and sprinkle with egg."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "mustard",
      "red-wine vinegar",
      "olive oil",
      "avocado",
      "chicken",
      "tomato",
      "bacon",
      "cheese",
      "shredded romaine",
      "four",
      "egg",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "potatoes vinaigrette",
    "ingredients": [],
    "directions": [
      "Place potatoes in a medium saucepan and cover with cold water.",
      "Bring to a boil, and add salt.",
      "Reduce to a simmer, and cook until just tender, 12 to 14 minutes.",
      "Drain; set aside to cool slightly.",
      "Meanwhile, in a medium bowl, combine vinegar and both mustards; season with salt and pepper.",
      "When potatoes are cool enough to handle, quarter and toss with mustard-vinegar mixture.",
      "Cover and refrigerate until chilled, about 2 hours or up to overnight.",
      "Add oil and celery stalk leaves to potatoes; toss and serve.",
      "(Per Serving)",
      "Calories: 220",
      "Fat: 10.7g (1.5g Saturated Fat)",
      "Protein: 3.2g",
      "Carbohydrates: 29.2g",
      "Fiber: 4.3g"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "new potatoes",
      "salt",
      "white-wine vinegar",
      "mustard",
      "whole-grain mustard",
      "olive oil",
      "celery stalk",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "spicy spreadable cheesecake",
    "ingredients": [],
    "directions": [
      "For the crust: Crush the butter crackers and mix with melted butter.",
      "Press into a 9-inch spring-form pan.",
      "For the Filling: Finely shred cheddar, add lime zest.",
      "Toss cheese mixture with flour and cornstarch; set aside.",
      "Preheat the oven to 325 degrees F.",
      "In electric mixer, cream lime juice and cream cheese until fluffy.",
      "Add 1 egg at a time while mixing on low speed.",
      "Add minced onion, horseradish, pepper sauce, oregano, cumin, garlic powder, salt, and pepper and mix only until incorporated.",
      "Fold in cheddar mixture, then sour cream by hand.",
      "Pour the batter into the prepared crust.",
      "Bake for 60 minutes.",
      "Meanwhile, for topping, mix all ingredients together and refrigerate until cheesecake is baked.",
      "Remove cheesecake from oven after 60 minutes (do not overbake).",
      "Spread cold topping over warm cake, return to oven, shut the oven off and allow to cool in oven (oven door may be open a crack to speed up the process), this will prevent any cracking.",
      "Refrigerate at least 4 hours or overnight then decorate as desired with shredded cheddar, tomatoes, green onions, and salsa.",
      "Serve with crackers or tortilla chips."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "crackers",
      "butter",
      "cheddar",
      "lime zest",
      "flour",
      "cornstarch",
      "lime juice",
      "cream cheese",
      "eggs",
      "white onion",
      "horseradish",
      "hot red pepper sauce",
      "oregano",
      "cumin",
      "garlic",
      "salt",
      "pepper",
      "sour cream",
      "sour cream",
      "lime juice",
      "lime zest",
      "sugar",
      "hot red pepper sauce",
      "cheddar",
      "Tomatoes",
      "Green Onions",
      "Salsa",
      "Crackers",
      "Tortilla Chips",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "root beer barbecue beans recipe",
    "ingredients": [],
    "directions": [
      "Cook the bacon with the onions in a medium saucepan over a grill or side burner until the bacon is brown and crisp, and the onions have become transparent and are just starting to brown.",
      "Add all of the remaining ingredients.",
      "Bring to a boil over medium-high heat; then reduce the heat and simmer, stirring often, until the mixture is slightly thickened, about 20 minutes.",
      "Remove the celery and serve the beans hot."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "bacon",
      "onion",
      "beans",
      "root",
      "dark molasses",
      "dry mustard",
      "garlic salt",
      "lemon pepper",
      "celery",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "apple-cranberry galette",
    "ingredients": [],
    "directions": [
      "Preheat oven to 375 degrees F.",
      "Roll the pie crust out into a 12-inch circle.",
      "Place the crust on a large baking sheet.",
      "Top the crust with apple slices and cranberries.",
      "Drizzle lemon juice over top.",
      "Sprinkle sugar over top.",
      "Pull up the sides of the crust slightly and roll over, covering the filling by about 1 inch.",
      "Bake 20 minutes, or until the crust is golden brown and the apples are tender."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "crust",
      "apples",
      "cranberries",
      "lemon juice",
      "sugar",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "baked zucchini and tomato casserole",
    "ingredients": [],
    "directions": [
      "Cut up the tomatoes and put them on the bottom of a greased baking pan.",
      "Slice the zucchini and place on top of the tomatoes.",
      "Prepare the Stove Top Stuffing Mix and add to the top of the vegetables.",
      "Top with the grated cheddar cheese and season with salt, pepper and garlic powder.",
      "Bake at 350F for 20 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "tomatoes",
      "zucchini",
      "Stove Top Stuffing Mix",
      "cheddar cheese",
      "Salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "corn and black bean burgers with raddichio-watercress slaw",
    "ingredients": [],
    "directions": [
      "1.",
      "For the burgers: Put the vegetables (onion through peppers) in a fine metal sieve and drain residual liquid by pushing hard with your palm.",
      "Set aside.",
      "2.",
      "Pulse oats and nuts in food processor.",
      "Remove them from the processor and put them in a large-sized bowl with the breadcrumbs.",
      "3.",
      "Add black beans and corn to the food processor and pulse until coarsely blended.",
      "Add this mixture to the oats and breadcrumbs bowl along with drained vegetables and spices.",
      "4.",
      "Add eggs, Worcestershire sauce and BBQ sauce.",
      "Mix well using your hands.",
      "5.",
      "Using your hands shape mixture into six 4-inch x 1-inch patties.",
      "Place patties on a plate and put the plate in the freezer for at least 10 minutes.",
      "6.",
      "Meanwhile make slaw but mixing raddichio, cabbage and watercress in a large bowl.",
      "Combine oil, vinegar, honey, salt and pepper in a small bowl then add it to the slaw and toss to combine.",
      "7.",
      "Mix blue cheese dressing and chipotles in adobo in a small bowl.",
      "8.",
      "Heat a cast-iron skillet with a drizzle of oil over medium high heat.",
      "Once hot add burgers and grill burgers for 3-5 minutes on each side.",
      "At the end, cover skillet with a lid and cook for a couple of additional minutest to ensure burgers are heated throughout.",
      "9.",
      "Place burgers on toasted buns with slaw and chipotle spread.",
      "Enjoy!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Red Onion",
      "Carrots",
      "Garlic",
      "Italian Parsley",
      "Green Pepper",
      "Oats",
      "Bread Crumbs",
      "Black Beans",
      "Sweet Corn",
      "Cayenne Pepper",
      "Oregano",
      "Thyme",
      "Cumin",
      "Salt",
      "Black Pepper",
      "Eggs",
      "Worcestershire Sauce",
      "BBQ Sauce",
      "Skillet",
      "Hamburger",
      "Raddichio",
      "Green Cabbage",
      "Olive Oil",
      "Vinegar",
      "Honey",
      "Black Pepper",
      "Salt",
      "Blue Cheese Dressing",
      "Pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "caesar orzo with asparagus",
    "ingredients": [],
    "directions": [
      "In a large saucepan, bring broth and water to boil.",
      "Add orzo; cook and stir for 5 minutes.",
      "Add asparagus.",
      "Cook, uncovered, over medium heat 4-6 minutes or until pasta and asparagus are tender, stirring frequently; drain.",
      "Stir in Parmesan cheese and Caesar dressing."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chicken broth",
      "water",
      "orzo pasta",
      "fresh asparagus",
      "parmesan cheese",
      "caesar salad dressing",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chocolate chip shortbread sticks",
    "ingredients": [],
    "directions": [
      "Cream butter, sugar, and vanilla until blended.",
      "On low speed, beat in flour.",
      "Stir in 1/2 chips.",
      "Cover and chill until firm (though not too firm, I had to let mine sit til it was workable!",
      ").",
      "Shape heaping TBs into 3-inch-long, 1/2-inch-thick logs (like biscotti).",
      "Place on lightly greased cookie sheet and bake in a 350F (180C).",
      "oven for 8 minutes or until golden brown.",
      "Cool.",
      "Melt remaining chips and oil, dip 3/4 inch of one end of each cookie into chocolate."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butter",
      "powdered sugar",
      "vanilla",
      "flour",
      "chocolate chips",
      "vegetable oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "gingered pear and currant breads",
    "ingredients": [],
    "directions": [
      "Into a bowl sift together the flour, the baking powder, the salt, and the cinnamon.",
      "In a small bowl toss together the pears and the lemon juice.",
      "In a large bowl with an electric mixer cream the butter with the brown sugar and beat in the vanilla and the eggs, 1 at a time.",
      "Add the ginger and the pear mixture and beat the mixture until it is combined well.",
      "Beat in the flour mixture and beat the mixture until it is just combined.",
      "Stir in the currants, divide the batter among 4 buttered and floured loaf pans, each 5 3/4 by 3 1/4 by 2 inches, and bake the breads in the middle of a preheated 350F.",
      "oven for 40 to 45 minutes, or until they are pale golden and a tester comes out clean.",
      "Remove the breads from the pans and let them cool, right sides up, on a rack.",
      "The breads keep, wrapped well in plastic wrap and foil, chilled for 1 week or frozen for 1 month."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "flour",
      "double-acting baking powder",
      "salt",
      "cinnamon",
      "lemon juice",
      "unsalted butter",
      "brown sugar",
      "vanilla",
      "eggs",
      "ginger",
      "currants",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "apple-cheddar strata",
    "ingredients": [],
    "directions": [
      "Spray 9 1/2-inch deep dish glass pie plate with cooking spray.",
      "Arrange bread cubes in bottom of pie plate.",
      "Spoon apples evenly over bread, sprinkle with ham and cheese.",
      "In medium bowl, beat eggs, half and half, and pepper with wire whisk until well blended.",
      "Carefully pour over apples, ham and cheese.",
      "Cover; refrigerate at least 6 hours or overnight.",
      "Heat oven to 350*.",
      "Bake, uncovered 40 to 45 minutes or until top is lightly browned and center is set.",
      "Let stand 10 to 15 minutes before serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "white bread",
      "apples",
      "cheddar cheese",
      "eggs",
      "white pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "tea cakes",
    "ingredients": [],
    "directions": [
      "Cream the sugar, butter and eggs together.",
      "Mix together the flour, salt and baking powder.",
      "Gradually add the flour mixture to the butter mixture.",
      "Once this is well mixed, add the vanilla and vinegar.",
      "Roll about 1/4 of the dough at a time to about 1/8\" thick.",
      "Cut with cookie cutters.",
      "Bake in oven at 350 for 8-10 minutes or until starting to brown on the edges."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "sugar",
      "butter",
      "eggs",
      "flour",
      "salt",
      "baking powder",
      "vanilla",
      "vinegar",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "spaghetti with bacon and beef sauce",
    "ingredients": [],
    "directions": [
      "Heat a drizzle of EVOO in a pot over medium-high heat.",
      "Add the bacon and cook until browned.",
      "Transfer the bacon to a plate and pour the fat from the pot.",
      "Add 2 turns of the pan of EVOO.",
      "Pat the beef dry, then add it to the pot and cook until browned, crumbling the meat with a wooden spoon.",
      "Add the garlic, bay leaves, chile pepper, onions, cloves, a little salt and lots of pepper.",
      "Cook, stirring frequently, for 10 minutes.",
      "Add the wine and deglaze the pan, scraping up the browned bits from the bottom.",
      "Add the beef stock and tomato paste, then stir in the crushed tomatoes and bacon.",
      "Simmer until thickened.",
      "Bring a large pot of water to a boil for the pasta and season with salt.",
      "Add the pasta and cook until al dente.",
      "Reserve 1 cup of the cooking liquid, then drain the pasta.",
      "Add the cooking liquid and the pasta to the sauce and toss to combine.",
      "Serve the pasta topped with cheese and parsley.",
      "Cook's Note: If you are not serving the sauce immediately, cool and store in the refrigerator.",
      "Reheat over medium heat."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "EVOO",
      "smoky bacon",
      "ground sirloin",
      "garlic",
      "bay leaves",
      "chile pepper",
      "onion",
      "ground cloves",
      "Salt",
      "red wine",
      "beef stock",
      "tomato paste",
      "Italian crushed tomatoes",
      "spaghetti",
      "pecorino",
      "flat-leaf parsley",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "broken wheat pudding ( lapsi kheer ) recipe",
    "ingredients": [],
    "directions": [
      "(To make coconut lowfat milk finely grate a fresh coconut add in 150ml of warm water and squeeze to extract the thick lowfat milk.",
      "You should get roughly 300ml of coconut lowfat milk from a coconut.)",
      "Cook the broken wheat in the water till soft.",
      "Stir in the jaggery and cook till blended.",
      "Add in the coconut lowfat milk and cardamom pwdr.",
      "Bring to the boil once and remove from the heat.",
      "Serve hot.",
      "This is a pudding from south India and is made on festive occasions.",
      "Serves 4"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "broken wheat",
      "water",
      "jaggery grated",
      "coconut lowfat milk",
      "pwdr",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pan seared grouper with tropical salsa",
    "ingredients": [],
    "directions": [
      "To make the tropical salsa: Mix all ingredients except oil, grouper and Cajun spice.",
      "Let sit while you prepare the grouper.",
      "To make the grouper: In a cast iron frying pan, heat olive oil until smoking.",
      "Coat both sides of grouper with Cajun spice.",
      "Place coated grouper in pan.",
      "Cook for 2 to 3 minutes per side (depending on thickness) until done.",
      "Transfer grouper to a serving dish, placing on top of mixed greens.",
      "Spoon Tropical Salsa on top of fish.",
      "* Cook's Note: This recipe also works well with flounder and other types of fish."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "mango",
      "pineapple",
      "papaya",
      "peppers",
      "cilantro",
      "jalapenos",
      "olive oil",
      "fillet per",
      "Cajun spice",
      "Mixed greens",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "lantern pasta with chicken and asparagus",
    "ingredients": [],
    "directions": [
      "Put 8 cups of water on to boil and and salt well.",
      "Heat the olive oil in a nonstick pan on medium heat.",
      "Empty the tomatoes into the pan and mash with a spoon (or use your hands).",
      "Slice the asparagus and the chicken on the bias and slice the olives.",
      "When the water comes to a boil, add the pasta and cook for approximately 10 minutes or until al dente.",
      "Meanwhile, add the chicken, asparagus, olives, half of the chili flakes and pesto to the pan with the tomatoes.",
      "Salt to taste.",
      "Simmer on medium low while pasta is cooking.",
      "When the pasta is done, add it to the sauce and simmer for two more minutes.",
      "Add the cheese, sprinkle with remaining chili flakes, toss and serve!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Chicken",
      "Garlic",
      "Tomatoes",
      "Olive Oil",
      "Pasta",
      "Pre-made Pesto",
      "Salt",
      "Chili Flakes",
      "White String Cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "butternut mash with orange-sesame drizzle",
    "ingredients": [],
    "directions": [
      "Bring squash and broth to a boil in saucepan.",
      "Reduce heat to medium, partially cover, and cook 12 minutes, or until squash is very tender and most of broth has been absorbed.",
      "Mash with potato masher until chunky-smooth.",
      "Transfer to serving bowl.",
      "Whisk together orange juice concentrate, sesame seeds, tamari, sesame oil, and ginger in small bowl.",
      "Drizzle over squash, and garnish with green onion."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butternut squash",
      "vegetable broth",
      "orange juice",
      "sesame seeds",
      "tamari",
      "sesame oil",
      "fresh ginger",
      "green onion",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "acid jellies",
    "ingredients": [],
    "directions": [
      "In small saucepan, combine 1/2 cup of water, gelatin, lime juice, and lemon juice.",
      "Set aside.",
      "In heavy small saucepan, place over medium heat, combine remaining 3/4 cup of water and 1 cup sugar and stir until sugar dissolves.",
      "Bring to a boil, cover and cook for 3 minutes.",
      "Remove lid and place candy thermometer on side of pan and cook until it reaches 300 degrees F. Remove from heat, add to gelatin mixture, return pan to low heat and stir constantly in order to dissolve gelatin completely.",
      "Add lemon and lime zest and stir to combine.",
      "Pour mixture into greased 8-inch by 8-inch pan and cool to room temperature.",
      "Do not refrigerate.",
      "Once cooled, cut into cubes and toss to coat in the remaining sugar.",
      "Store in airtight container for up to 4 days."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "water",
      "gelatin",
      "freshly squeezed lime juice",
      "freshly squeezed lemon juice",
      "sugar",
      "lime zest",
      "lemon zest",
      "spray",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "amish banana bread",
    "ingredients": [],
    "directions": [
      "Combine cream cheese,sugar,and margarine.",
      "Mix until well blended.Blend in bananas and eggs.",
      "Add dry ingredients, mixing until moistened.",
      "Fold in nuts.",
      "Pour into a greased and floured 9x13-inch loaf pan.",
      "Bake at 350F for 1 hour, or until a toothpick inserted in center comes out clean.",
      "Allow to cool before slicing."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "cream cheese",
      "sugar",
      "margarine",
      "very ripe bananas",
      "eggs",
      "flour",
      "baking powder",
      "baking soda",
      "nuts",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chocolate and cheese tart with cinnamon",
    "ingredients": [],
    "directions": [
      "To make the pastry, combine the flour and 1 cup of the sugar in a large bowl.",
      "Make a well in the center and combine the melted lard or butter and 5 egg yolks in the well.",
      "Mix the ingredients into a dough with a wooden spoon.",
      "Add a little water if dough is too stiff.",
      "Knead the dough on a work surface for 1 minute.",
      "Set aside.",
      "In a small bowl, combine remaining sugar, the cinnamon, and the cocoa.",
      "Set aside.",
      "Preheat the oven to 350 degrees.",
      "Butter the bottom and sides of a 10-inch round baking pan.",
      "Divide the dough in half.",
      "Roll each half of the dough out to a 12-inch circle.",
      "Fit 1 circle of dough into the bottom of the pan, letting it come up the sides about 2 inches.",
      "Let rest.",
      "Beat the egg whites in a bowl until they just begin to stiffen.",
      "Add the sugar mixture a scoop at a time, and continue beating the whites until they are stiff.",
      "Fold in the candied citron and cheese.",
      "Pour the filling into the pastry-lined pan and smooth the top evenly.",
      "Cover the mixture with the remaining circle of pastry.",
      "Crimp the edges of the dough together.",
      "Make a 3/4-inch hole in the center of the top of the tart.",
      "Brush the top with the remaining egg yolk.",
      "Bake the tart on a baking sheet on the center shelf of the oven for 1 hour or until golden brown.",
      "Remove the tart from the oven and let cool on a rack for at least 30 minutes.",
      "Dust the tart with confectioners sugar just before serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "flour",
      "sugar",
      "lard",
      "eggs",
      "egg yolk",
      "ground cinnamon",
      "cocoa powder",
      "candied citron",
      "goat cheese",
      "Confectioners sugar",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chocolate strawberry ice cream sandwiches",
    "ingredients": [],
    "directions": [
      "Beat the butter, essence, icing sugar and egg in a small bowl with an electric mixer until mixture is light and fluffy.",
      "Mix together the almond meal, flour and cocoa powder and stir into the butter mixture until well combined and a soft dough has formed.",
      "Wrap dough in plastic wrap and refrigerate for 1 hour.",
      "Roll out dough between 2 pieces of baking paper until 3mm thick.",
      "Place paper and dough on a tray and freeze for 10 minutes.",
      "Cut shapes in dough with a cookie cutter.",
      "You can use any shape you like, as long as you can sandwich some ice-cream between it.",
      "Try heart shapes for a romantic occasion, rounds, stars or whatever!",
      "You need 12 cookies to make 6 sandwiches.",
      "Place shapes onto a greased oven tray and bake at 180 degree C for about 12 minutes.",
      "Remove from oven and leave cookies on tray for 5 minutes to firm up then transfer them carefully to a wire rack to cool completely.",
      "To serve, sandwich the cookies together with scoops of strawberry ice-cream (or another flavour if you prefer).",
      "Decorate with a dusting of extra cocoa powder and some fresh strawberries."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butter",
      "vanilla essence",
      "powdered sugar icing",
      "egg",
      "almond meal",
      "flour",
      "cocoa powder",
      "strawberry ice cream",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "marvelous marinated steak recipe",
    "ingredients": [],
    "directions": [
      "Shake juice and Good Seasons mix together.",
      "Add in oil and shake again.",
      "Pour over meat, chill covered at least 3 hrs.",
      "Broil, basting occasionally, about 15 min on each side."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "lemon juice",
      "Italian salad dressing",
      "salad oil",
      "chuck",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "potato and leek pancakes",
    "ingredients": [],
    "directions": [
      "For the pancakes: put the potatoes in a pan and cover with cold water.",
      "Add a pinch of salt, cover and bring to the boil.",
      "Cook for 15-20 minutes until cooked.",
      "Drain the potatoes well.",
      "Mash half of them and coarsely grate the remainder.",
      "Put the leeks in a pan and cover with plenty of lightly salted water.",
      "Cover and cook for 3-5 minutes until tender.",
      "Drain well then press with kitchen paper to extract as much moisture as possible.",
      "Sift the dry ingredients into a bowl, and mix in the mashed and grated potatoes and the leeks.",
      "Stir in enough buttermilk to make a thick batter.",
      "Heat the butter in a non-stick frying pan.",
      "Spoon in some of the batter and cook for about 2 minutes or until the top of the pancake is silky and bubbly.",
      "Turn over and cook for a few more minutes until golden and puffy.",
      "Repeat with the remaining batter.",
      "Keep the pancakes warm.",
      "For the topping: heat the oil in a separate pan and cook the bacon until golden and crisp.",
      "Add the butter, sage and lemon juice.",
      "To serve: put the pancakes on serving plates and spoon the bacon mixture over the top."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "floury potatoes",
      "leeks",
      "flour",
      "baking soda",
      "buttermilk",
      "unsalted butter",
      "oil",
      "bacon",
      "sage",
      "lemon juice",
      "butter",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pumpkin whole grain muffins",
    "ingredients": [],
    "directions": [
      "Preheat oven to 400F and grease 18 1/2-cup muffin cups.",
      "In a bowl whisk together applesauce, pumpkin, greek yogurt, eggs, molasses, honey (or agave) and vanilla.",
      "Into a large bowl sift together flour and oats, baking powder, spices, salt, and baking soda.",
      "Make a well in center of flour mixture and add pumpkin mixture, stirring just until combined.",
      "Stir in nuts and divide batter among cups.",
      "Bake muffins in middle of oven 20 to 25 minutes, or until puffed and a tester comes out clean.",
      "Cool muffins in cups 5 minutes and turn out onto a rack.",
      "Serve muffins warm or at room temperature."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "fresh applesauce",
      "solid-pack",
      "non-fat",
      "egg",
      "molasses",
      "vanilla",
      "honey",
      "whole wheat flour",
      "oats",
      "baking powder",
      "ground cinnamon",
      "ground ginger",
      "ground cloves",
      "nutmeg",
      "salt",
      "baking soda",
      "walnuts",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "ice cream cookie sundaes",
    "ingredients": [],
    "directions": [
      "Place the scoops of chocolate chip cookie dough and chocolate ice cream into a sundae glass.",
      "Take the Yummy Slice-and-Bake Cookies and break them up into small pieces over the ice cream.",
      "Heat the caramel and hot fudge sauces and drizzle over the cookies and ice cream, then sprinkle over some mini chocolate candies.",
      "Squirt on some whipped cream and top with sprinkles or other toppings as you fancy.",
      "Finish with a cherry on the top.",
      "Combine the flour, instant coffee, baking soda and salt in a bowl.",
      "Stir together and set aside.",
      "Cream together the butter with the brown and granulated sugar, scraping the bowl once while mixing.",
      "Add the eggs, mixing one at a time, and then the vanilla.",
      "Add the chocolate-hazelnut spread and peanut butter and mix.",
      "Add the dry ingredients in increments, mixing gently after each addition.",
      "Scrape the bowl once and mix again.",
      "Add the chopped chocolate candies and pecans and mix gently to combine.",
      "Add more of either ingredient if needed.",
      "Spoon the dough on a long piece (or 2 shorter pieces) of waxed paper or plastic wrap.",
      "Carefully roll the dough inside the wrap, pressing gently to get it to form into a firm cylinder.",
      "Refrigerate for at least 3 to 4 hours, or place in the freezer for 20 to 30 minutes.",
      "Preheat the oven to 375 degrees F.",
      "Slice off as many cookies as you'd like and lay the slices on a baking sheet.",
      "(The thicker the slices, the farther apart the cookies will need to be; they bake up flat.)",
      "Bake until nice and golden brown, about 10 minutes.",
      "Yield: 30 cookies"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chocolate chip",
      "chocolate ice cream",
      "Cookies",
      "caramel sauce",
      "sauce",
      "chocolate candies",
      "whipped cream",
      "Sprinkles",
      "Maraschino cherries",
      "flour",
      "coffee granules",
      "baking soda",
      "salt",
      "butter",
      "brown sugar",
      "granulated sugar",
      "eggs",
      "vanilla",
      "chocolate-hazelnut spread",
      "peanut butter",
      "chocolate candies",
      "pecans",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "broccoli salad",
    "ingredients": [],
    "directions": [
      "Cut broccoli into pieces, (I use most of the broccoli, even some of the stem), add chopped red onion and bacon.",
      "In a small bowl, mix together mayo, brown sugar and lemon juice, refrigerate for a couple of hours for better flavour.",
      "Just before serving add dressing to broccoli, onion and bacon, top with cheddar cheese.",
      "(It is best to add the dressing just before serving to keep the broccoli and bacon crispy) Enjoy."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "broccoli",
      "red onion",
      "bacon",
      "mayonnaise",
      "brown sugar",
      "lemon juice",
      "cheddar cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "boysenberry tiramisu recipe",
    "ingredients": [],
    "directions": [
      "About 3 hrs before serving or possibly early in day: Thaw frzn Boysenberries as label directs.",
      "Meanwhile, grate semi-sweet chocolate.",
      "Reserve 1/4 c. grated chocolate for garnish.",
      "In large bowl, with wire whisk or possibly fork, beat cream cheese, coffee flavor liqueur, lowfat milk, vanilla extract, and remaining grated chocolate till well blended.",
      "In small bowl, with mixer at medium speed, beat heavy or possibly whipping cream and confectioners' sugar till stiff peaks forms.",
      "Reserve 2 c. mix for topping.",
      "With rubber spatula or possibly wire whisk, fold remaining 1 c. whipped cream mix.",
      "Into 8 dessert glasses, place half of crumbled vanilla wafers; top with half of cream mix.",
      "Spoon half of thawed Boysenberries with their syrup over cheese mix; top with remaining vanilla wafers, remaining thawed raspberies, then with remaining cheese mix.",
      "Spoon reserved whipped cream mix into decorating bag with small rosette tube.",
      "Pipe whipped cream around edge of each dessert glass.",
      "Sprinkle reserved grated chocolate in center of each dessert.",
      "Garnish with fresh raspberies.",
      "Chill at least 2 hrs to blend flavor.",
      "Makes 8 servings."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "red Boysenberries",
      "chocolate",
      "whipped cream",
      "Coffee-flavor",
      "milk",
      "Vanilla",
      "whipping cream",
      "Vanilla wafers",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "tarte aux fraises",
    "ingredients": [],
    "directions": [
      "In a small, heavy-bottomed saucepan, scald the milk with half the vanilla bean over medium-high heat.",
      "Remove from heat, cover the pan and let infuse 10 to 15 minutes.",
      "In a bowl, whisk together 2 of the egg yolks with the sugar.",
      "Whisk in the 2 tablespoons of flour.",
      "Remove the vanilla bean from the milk and slowly whisk the milk into the yolk mixture.",
      "Return the mixture to the pan and bring to a boil, whisking continuously.",
      "Lower the heat and continue to cook, whisking, for about 2 minutes or until the mixture has thickened.",
      "Pour into a bowl and place a piece of plastic wrap directly on the mixture.",
      "Let cool.",
      "Preheat the oven to 400 degrees.",
      "In a food processor fitted with a steel blade, process the 1 1/4 cups flour, butter and 1 tablespoon confectioners' sugar until combined.",
      "Add the remaining egg yolk and, with the processor still running, add the water slowly until the dough begins to hold together and pull away from the sides of the processor bowl.",
      "Form the dough into a ball and flatten into a disk.",
      "Place the dough between 2 sheets of wax paper or plastic wrap to facilitate the rolling and roll out to a thickness of 1/8 inch.",
      "Line 16 3-inch tartlet molds with the pastry.",
      "Prick the dough all over with a fork.",
      "Place the molds on a baking sheet and bake for 12 to 15 minutes, or until slightly browned.",
      "Remove the shells from the molds and allow to cool completely.",
      "To assemble the tartlets, fill each shell with a heaping teaspoon of the pastry cream, top with the sliced strawberries and dust generously with confectioners' sugar."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "milk",
      "vanilla bean",
      "egg yolks",
      "sugar",
      "flour",
      "cold butter",
      "sugar",
      "water",
      "pints strawberries",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chopped salad to go",
    "ingredients": [],
    "directions": [
      "Mix dressing and mayo in 3-cup resealable container; top with remaining ingredients.",
      "Seal container.",
      "Refrigerate up to 24 hours.",
      "Shake container to evenly coat salad with dressing just before serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Italian Dressing",
      "Mayonnaise",
      "chopped lettuce",
      "tomatoes",
      "red onions",
      "Turkey",
      "Bacon",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "caramelized diver scallops recipe",
    "ingredients": [],
    "directions": [
      "In a saute/fry pan, heat the extra virgin olive oil.",
      "When the oil is warm, saute/fry the corn, onions, garlic, and peppers for 3 min.",
      "Season with salt and pepper.",
      "Add in the frisee, parsley and water.",
      "Cook to wilt the frisee, about 2 min.",
      "Remove from the heat.",
      "Season the scallops with salt and pepper.",
      "Dredge the scallops in the sugar.",
      "In a saute/fry pan, heat the remaining 1 Tbsp.",
      "of extra virgin olive oil.",
      "When the pan is smoking warm, caramelize the scallops for 2 to 3 min on each side.",
      "Remove from the heat.",
      "Spoon the sauce on the bottom of the plate.",
      "Mound the salad in the center of the sauce.",
      "Arrange the scallops around the salad.",
      "Garnish with shaved truffle, long chives, minced chives and Emeril's Essence.",
      "This recipe yields 4 appetizer servings."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Extra virgin olive oil",
      "Fresh corn kernels",
      "onions",
      "garlic",
      "red peppers",
      "parsley",
      "Water",
      "shell",
      "Sugar",
      "cream of corn",
      "Chives",
      "chives",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "konnyaku okonomiyaki",
    "ingredients": [],
    "directions": [
      "Cut the konnyaku into 3 mm thick slices, then cut into half horizontally (but as long as they're bite-sized pieces, any cutting method is fine).",
      "Mince the cabbage.",
      "Add Steps 1 and 2 to a bowl.",
      "Add the flour, dashi stock, egg, and water and mix well.",
      "Pour Step 3 into a lightly oiled frying pan in two parts (to make 2 okonomiyaki patties).",
      "Cook on low heat until both sides have browned.",
      "Transfer to a serving plate and top with your desired amount of sauce, bonito flakes, and aonori."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Cabbage",
      "Flour",
      "stock",
      "Egg",
      "Water",
      "flakes",
      "sauce",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "sweet spiders",
    "ingredients": [],
    "directions": [
      "Beat the food coloring into the icing.",
      "Line a cookie sheet with wax paper.",
      "Put the icing in a plastic bag or piping bag with a very small openning.",
      "Pipe spider shapes on the wax paper.",
      "Keep the icing cool by putting it in the refrigerator from time to time while you work.",
      "After the spiders have dried store in a dry place."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "royal icing",
      "drops black food coloring",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cornmeal-buttermilk blueberry biscuits",
    "ingredients": [],
    "directions": [
      "In a small baking pan, place the blueberries in one layer.",
      "Freeze them for 30 to 45 minutes or until firm.",
      "Set the oven at 400 degrees.",
      "Have on hand a large, heavy baking sheet.",
      "In a mixing bowl, sift the flour, baking powder, baking soda, cream of tartar, salt, and sugar.",
      "Whisk in the cornmeal.",
      "Scatter the chunks of butter over the mixture.",
      "Using a pastry blender or two round-bladed table knives, cut the fat into the flour until it is reduced to the size of large peas.",
      "Pour the buttermilk over the flour mixture, scatter over the blueberries, and use a spatula to stir lightly but thoroughly to form a dough.",
      "Bring the dough clumps together with your fingertips.",
      "The dough will be moderately moist but workable.",
      "Turn the dough out onto a lightly floured counter.",
      "With a rolling pin, roll it into a 3/4-inch-thick slab, keeping a square shape.",
      "With a straight-edged chef's knife, cut the dough into 12 rectangles that are about 1 3/4-inches long.",
      "Place them 1-inch apart on the baking sheet (if you prefer firmer sides), or 1/2-inch apart (for softer sides).",
      "Bake the biscuits for 15 to 18 minutes, or until set and golden.",
      "Transfer to a wire rack to cool slightly."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "fresh blueberries",
      "flour",
      "baking powder",
      "baking soda",
      "cream of tartar",
      "salt",
      "sugar",
      "yellow cornmeal",
      "unsalted butter",
      "buttermilk",
      "extra flour",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "barbecue beef for sandwiches",
    "ingredients": [],
    "directions": [
      "Place roast in a large covered pan.",
      "Roast at 325 degrees F (165 degrees C) for 2 hours, or until the meat falls apart and shreds easily.",
      "In a large skillet, melt butter over medium heat.",
      "Add onions, and saute until onions become translucent.",
      "Stir in vinegar and chili sauce.",
      "Fill empty chili sauce bottle with water, shake, and pour liquid into skillet.",
      "Mix in brown sugar, mustard, Worcestershire sauce, black pepper, salt, cayenne pepper, and garlic.",
      "Cook sauce over low heat, stirring often, until thickened.",
      "With two forks, shred roasted beef.",
      "Stir meat into the sauce in the skillet, and simmer for 30 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chuck roast",
      "onion",
      "butter",
      "distilled white vinegar",
      "chile sauce",
      "brown sugar",
      "mustard powder",
      "Worcestershire sauce",
      "freshly ground black pepper",
      "salt",
      "ground cayenne pepper",
      "garlic",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "spinach and feta quiche",
    "ingredients": [],
    "directions": [
      "Let the frozen pie shell sit out a few minute until you can easily prick it with a fork and then prick the heck out of its sides and bottom.",
      "Prebake the pie shell per the packages instuctions until the sides are lightly browned, set aside.",
      "Saute the shallots in olive oil until tender then incorporate the rinsed spinach by the handful until it's all cooked down.",
      "Mix in some of the feta.",
      "Sprinkle with salt & pepper.",
      "Set aside.",
      "Mix the four eggs in a 2-cup measuring cup and add half & half to reach 1-1/2 cups.",
      "Season with salt and pepper.",
      "(Nutmeg if desired).",
      "Layer the bottom of the cooled pie shell with feta cheese.",
      "Pour the semi cooled spinach mixture over the cheese.",
      "Slowly pour the egg mixture over the pie, letting it seep in and filling it almost to the rim.",
      "Sprinkle a little swiss cheese on top, if desired.",
      "Bake in oven at 375 to 400 until set and browned, 25 to 30 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "frozen pie shell",
      "Spinach",
      "shallots",
      "feta cheese",
      "eggs",
      "cream",
      "salt",
      "swiss cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "big bobs competition sweet sauce",
    "ingredients": [],
    "directions": [
      "Combine the ingredients in a small bowl and blend well.",
      "Make at least 24 hours prior to usage for best flavor.",
      "Store the sauce in a tightly covered jar for up to 2 weeks in the refrigerator."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Gibson Championship",
      "honey",
      "red sauce",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "how cheesy do you want 'em",
    "ingredients": [],
    "directions": [
      "Thaw dough for 2 hours.",
      "Cut loaf in 10-12 slices.",
      "Dip tops in butter then into cheese.",
      "Use either Pam or Crisco to grease pan well.",
      "Arrange in pan or bundt pan.",
      "Let rise 3-4 hours.",
      "Bake at 375 for 20 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "bread",
      "butter",
      "cheddar cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "black bean chilaquiles recipe",
    "ingredients": [],
    "directions": [
      "1.",
      "Pre-heat oven to 300 degrees F, 150 degrees C, gas mark",
      "2.",
      "2.",
      "Bake the tortillas directly on the oven shelf for 15 to 20 min, turning once till crisp right through.",
      "They will break with a clean snap.",
      "Break into coarse pcs and set aside.",
      "3.",
      "Spread onion pcs out in a heavy frying pan.",
      "Cook over moderate heat without stirring till the onions are sizzling and beginning to stickto the pan.",
      "Stir in the stock and let it bubble up, stirring up the browned deposits in the pan as it bubbles.",
      "Stir in the garlic and the spices.",
      "Turn the heat down and simmer, stirring frequently till the mix is thick, not at all soupy, and the onions and spices are frying in their own juices.",
      "Do not rush this step.",
      "It is essential which the spices shouldn't have a harsh raw taste.",
      "4.",
      "Stir in the black beans and heat gently.",
      "Mash roughly while still inthe pan, with a potato masher.",
      "You want a rough lumpy mix, not a smooth puree.",
      "Set aside.",
      "5.",
      "In a gratin dish spread a layer of a third of the tortilla pcs.",
      "Spread a layer of the black beans over the tortillas and spread a third ofthe tomato sauce over the black beans.",
      "Sprinkle with one third of the cheeses.",
      "Repeat this, ending with a layer of the beans, sauce and cheeses.",
      "6.",
      "Bake for 30 min covered.",
      "Uncover, and bake for 5 - 10 min more.",
      "Serve garnished with lime wedges."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Corn Tortillas",
      "Onion",
      "chicken",
      "garlic",
      "Cayenne pepper",
      "cumin",
      "black beans",
      "Tomato sauce",
      "mozzarella cheese",
      "Parmesan cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "bacon-jalapeno puffs",
    "ingredients": [],
    "directions": [
      "Heat oven to 350 degrees F.",
      "Cook bacon in medium skillet until crisp.",
      "Remove bacon from skillet, reserving drippings in skillet.",
      "Add peppers to skillet; cook 2 to 3 min.",
      "or until crisp-tender.",
      "Remove peppers from skillet; drain on paper towels.",
      "Crumble bacon.",
      "Combine all ingredients except crackers; roll into 36 balls.",
      "Place crackers in single layer on baking sheet; top with cheese balls.",
      "Bake 5 min.",
      "or until heated through."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Bacon",
      "pepper",
      "PHILADELPHIA Cream Cheese",
      "Cheddar Cheese",
      "ground red pepper",
      "Crackers",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "lemon glazed brussels sprouts",
    "ingredients": [],
    "directions": [
      "Combine first 4 ingredients in large pot; cover and bring to boil over high heat.",
      "Reduce heat to medium.",
      "Cook until brussels sprouts are crisp-tender, about 10 minutes, stirring occasionally.",
      "Stir in lemon juice; cook uncovered until glaze coats brussles sprouts, about 1 minute.",
      "Season to taste with salt and pepper.",
      "Transfer brussels sprouts to a bowl, sprinkle with lemon peel and serve."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Brussels sprouts",
      "water",
      "butter",
      "olive oil",
      "lemon juice",
      "grated lemons",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "rachel's potato puff",
    "ingredients": [],
    "directions": [
      "Peel potatoes.",
      "Grate potatoes and cheese.",
      "Coarsely chop bacon.",
      "Chop onion.",
      "Crush garlic clove.",
      "Add all ingredients to a bowl.",
      "Add salt and pepper to taste.",
      "You may add aromic herbs if you desire.",
      "Mix until all ingredients are combined.",
      "Pour mixture into a greased casserole dish.",
      "Bake in 180 degree celsius oven for 70 minutes or until top is golden brown."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "potatoes",
      "matured cheese",
      "milk",
      "eggs",
      "bacon",
      "salt",
      "pepper",
      "onion",
      "garlic",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "venison steaks with chestnuts",
    "ingredients": [],
    "directions": [
      "Melt half a tablespoon of butter in a heavy saucepan, add a good grinding of black pepper and gently cook chopped green (spring) onions.",
      "Add port and reduce.",
      "Add stock and 24 peeled chestnuts and simmer for about 20 minutes or until the sauce becomes syrupy.",
      "Set aside and keep warm.",
      "Heat a heat a heavy-based frying pan, add a tablespoon of butter.",
      "When it is very hot, cook 8 medallions of venison, each about 1 cm thick.",
      "Sear them for a maximum of 1 minute on each side, to ensure they are still rare.",
      "Meanwhile, butter a baking tray and slice onto it 4 figs.",
      "Place under a grill to heat through.",
      "Divide the sauce and chestnuts between four heated plates and add to each plate 2 medallions of venison and a fan of fig slices.",
      "Serve immediately."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butter",
      "black pepper",
      "scallions",
      "port wine",
      "stock",
      "chestnuts",
      "butter",
      "medallions",
      "figs",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "broccoli rabe and butternut squash",
    "ingredients": [],
    "directions": [
      "With a vegetable peeler or paring knife peel squash.",
      "Cut squash and onion into 1/4-inch dice and cut broccoli rabe into 1/2-inch pieces.",
      "In a 12-inch nonstick skillet heat oil over moderately high heat until hot but not smoking and add vegetables and salt to taste, stirring to coat with oil.",
      "Add water and cook vegetables, covered, over moderate heat 5 minutes, or until tender.",
      "Remove lid and cook vegetables over moderately high heat, stirring occasionally, until liquid is evaporated and vegetables begin to brown, about 3 minutes more."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "butternut squash",
      "red onion",
      "broccoli rabe",
      "olive oil",
      "water",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "linzer trees",
    "ingredients": [],
    "directions": [
      "Heat oven to 350 degrees.",
      "Line baking pans with parchment or silicone baking mats.",
      "In a bowl or stand mixer, mix butter and sugar on medium speed until smooth.",
      "In a separate bowl, whisk together flour, almond meal, cinnamon and salt.",
      "Slowly add dry ingredients, a half-cup at a time, to butter mixture.",
      "Divide dough into 3 balls.",
      "Place each ball between parchment paper (nonstick works best) and roll into a thin circle, about 11 inches in diameter and just over 1/8-inch thick.",
      "Refrigerate flat for at least 15 minutes.",
      "Working quickly with one sheet of dough, remove top layer of parchment, then flip onto a clean sheet and remove the bottom layer.",
      "Using a tree-shaped cookie cutter, cut 30 shapes for the bottoms of the cookies and place on prepared baking sheets.",
      "Reserve scraps to reuse for more cookies.",
      "Bake cookie bottoms for about 10 to 12 minutes, or until the edges just begin to brown.",
      "Rest for a couple of minutes on the tray, then carefully transfer to a cooking rack.",
      "Repeat the process to create the tops, using a pastry tip or a straw to cut out 5 to 7 holes on the trees to resemble ornaments.",
      "Open any holes that close during baking.",
      "Meanwhile, melt jam with 1 teaspoon of powdered sugar and boil lightly for about a minute.",
      "Cool slightly.",
      "Assemble cookies by flipping the bottoms, spreading them with a scant teaspoon of jam, dusting the tops lightly with powdered sugar and then gently pressing the tops onto the bottoms.",
      "Store airtight between layers of wax paper or parchment for 3 days.",
      "Freeze for up to a month."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "unsalted butter",
      "sugar",
      "flour",
      "ground",
      "cinnamon",
      "kosher salt",
      "raspberry",
      "Powdered sugar",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "island vegetable salad with cheese",
    "ingredients": [],
    "directions": [
      "Combine cucumbers, peppers, onions and parsley in large bowl.",
      "Add cheese and dressing; toss to coat.",
      "Serve on lettuce leaves."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "cucumber",
      "red pepper",
      "green onions",
      "parsley",
      "Cheese",
      "Italian Dressing",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "raspberry wasabi mustard",
    "ingredients": [],
    "directions": [
      "Mix the stone-ground mustard, yellow mustard and raspberry preserves in a bowl.",
      "Add in the wasabi 1/2 teaspoon at a time until the desired nose-heat is reached."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "stone-ground mustard",
      "yellow mustard",
      "raspberry preserves",
      "wasabi paste",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "meera sodhas chicken curry",
    "ingredients": [],
    "directions": [
      "Melt the butter or ghee in the oil in a large Dutch oven set over medium heat, and when it is hot and shimmering, add the cumin seeds and cinnamon sticks.",
      "Cook for a minute or two, stirring often, to intensify their flavors, then add the onions.",
      "Cook, stirring occasionally, until they are golden, approximately 15 to 20 minutes.",
      "Meanwhile, put the ginger, garlic and peppers into a mortar and pestle with a pinch of salt, and smash them together into a coarse paste.",
      "(You can also do this on a cutting board, with a knife.)",
      "Add the paste to the onions, and cook for 2 minutes or so, then pour in the tomatoes, and stir.",
      "Allow to cook for an additional 2 to 3 minutes, then add the tomato paste, ground cumin, ground turmeric and another pinch of salt, and stir to combine.",
      "Add the yogurt slowly to the mixture, using a wooden spoon to whisk it into the sauce.",
      "It may be quite thick.",
      "When it begins to bubble, add the chicken.",
      "Lower the heat, put the lid on the Dutch oven and allow the curry to cook gently for 30 minutes or so, or until the chicken is cooked through.",
      "Add the almonds and the garam masala, along with a pinch of cayenne, and cook for 5 minutes more or so.",
      "Serve with basmati rice or naan, and the additional yogurt."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "unsalted butter",
      "neutral oil",
      "cumin seeds",
      "cinnamon sticks",
      "white",
      "ginger",
      "garlic",
      "green cayenne",
      "Kosher salt",
      "tomatoes",
      "tomato paste",
      "ground cumin",
      "ground turmeric",
      "whole-milk yogurt",
      "skinless",
      "almonds",
      "garam masala",
      "ground cayenne pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "smoked turkey and white bean casserole with herbed crumb topping",
    "ingredients": [],
    "directions": [
      "Using a sharp knife, score the turkey pieces about 1/4-inch deep in several places.",
      "Place the turkey in a large soup pot or stockpot and add the chicken broth, Essence, cayenne pepper and bay leaves.",
      "Add 2 cups of water and bring to a boil.",
      "Reduce the heat to a simmer and cook the turkey, covered, until falling-from-the-bones tender, 2 1/2 to 3 hours.",
      "Set aside until cool enough to handle, then remove the meat from the bones and discard the skin and bones.",
      "Tear the meat into bite-size pieces and set aside.",
      "Reserve stock separately.",
      "In a large Dutch oven, heat the oil until hot.",
      "Add the onions, celery, and bell pepper and cook, stirring, until vegetables are softened, 4 to 6 minutes.",
      "Add the garlic and 2 teaspoons of the thyme and cook for 1 minute.",
      "Add the beans and 6 cups of the reserved stock (add water if necessary to bring the volume up to 6 cups) and return to a boil.",
      "Reduce the heat to a simmer and cook, partially covered, until the beans are tender but still firm enough to hold their shape, about 1 1/2 hours.",
      "The beans should be moist but not soupy.",
      "(If the beans are too soupy by the time they are tender, strain the beans and return the cooking liquid to the fire until reduced to a thick sauce consistency.",
      "Return the reduced cooking liquid to the beans.)",
      "Stir the reserved turkey meat into the beans and season with salt and pepper, to taste.",
      "Transfer to a large ovenproof casserole dish.",
      "Preheat the oven to 375 degrees F.",
      "In a small bowl combine the remaining thyme, bread crumbs, Parmesan, parsley, chives, and basil.",
      "Add the remaining 1/4 cup of olive oil and stir with a fork until well blended.",
      "Season with salt and pepper.",
      "Sprinkle the herb-bread crumb mixture evenly over the beans.",
      "Bake for 25 to 30 minutes, or until the topping is golden brown and the beans are bubbly around the edges.",
      "Combine all ingredients thoroughly.",
      "Yield: 2/3 cup",
      "Recipe from \"New New Orleans Cooking\", by Emeril Lagasse and Jessie Tirsch.",
      "Published by William Morrow, 1993."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "turkey",
      "chicken broth",
      "cayenne pepper",
      "bay leaves",
      "olive oil",
      "onion",
      "celery",
      "bell pepper",
      "garlic",
      "thyme",
      "white beans",
      "Salt",
      "bread crumbs",
      "Parmesan",
      "parsley",
      "fresh chives",
      "fresh basil",
      "olive oil",
      "paprika",
      "salt",
      "garlic",
      "black pepper",
      "onion powder",
      "cayenne pepper",
      "oregano",
      "thyme",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chicken & egg rice bowl / oyako-don",
    "ingredients": [],
    "directions": [
      "Cut the chicken into chunks and slice the onion.",
      "Heat the stock, then add soy sauce, mirin, and sugar, then let it boil.",
      "Add the onion and chicken to the stock.",
      "Leave it until the chicken is cooked.",
      "Do not boil it too much.",
      "Break the eggs into bowl but separate one egg york and gently whisk.",
      "Once the chicken is cooked, pour the egg (with egg white) over the chicken and onion leave it until the egg is cooked.",
      "Add the egg york and remove from the heat.",
      "Serve over the steamed rice and sprinkle the chives."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chicken breasts",
      "eggs",
      "onion",
      "mirin",
      "sugar",
      "soy sauce",
      "dashi stock",
      "rice",
      "chives",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "spinach quiche",
    "ingredients": [],
    "directions": [
      "Thaw spinach and drain well.",
      "Mix all of the filling ingredients together in a bowl.",
      "Divide evenly into two pie crusts.",
      "Bake in 350 degree oven for 45 minutes, or until silver knife incerted in center comes out clean."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "spinach",
      "eggs",
      "garlic salt",
      "milk",
      "cheddar cheese",
      "bacon bits",
      "dish pie shell",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "grilled peach upside-down cake",
    "ingredients": [],
    "directions": [
      "preheat your gas grill.",
      "In a deep 10-inch cast-iron skillet, melt the butter over indirect medium heat.",
      "Stir in 1/4 cup sugar and cook until browned, about 5 minutes.",
      "Add a pinch of salt, 1/4 tsp cinnamon and the sliced peaches.",
      "Cook until carmelized, about 5 minutes.",
      "Arrange the fruit in an even layer in the pan and let cool.",
      "In a medium bowl, toss the chopped peaches with the remaining 2 cups sugar and 1/4 tsp cinnamon.",
      "Sift together the flour, baking soda, and remaining 1/2 tsp salt.",
      "In a large bowl, whisk together the eggs and oil and add the vanilla.",
      "Gradually stir the flour mixture into the egg mixture until well mixed.",
      "Stir in the chopped peach-sugar mixture.",
      "Fold in the hazelnuts.",
      "Let the batter stand for 15 minutes.",
      "Stir the batter again (it will be very thick) and spread over the cooled fruit in the skillet.",
      "Place the skillet in the center of the grill and grill over indirect medium-low heat with the lid down, until a toothpick inserted in the center comes out clean, 1 1/4 to 1 1/2 hours.",
      "Let cool for 15 minutes.",
      "Invert into a platter and serve warm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "unsalted butter",
      "sugar",
      "salt",
      "salt",
      "ground cinnamon",
      "peaches",
      "flour",
      "baking soda",
      "eggs",
      "canola oil",
      "vanilla",
      "hazelnuts",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pop-overs",
    "ingredients": [],
    "directions": [
      "Preheat oven to 450F (230 degrees C).",
      "Grease and flour six 6-ounce custard cups, or cupcake pans.",
      "In a medium bowl beat eggs slightly, Beat in flour, milk and salt until just smooth; being careful not to overbeat.",
      "Fill custard cups 1/2 full.",
      "Bake at 450F (230 degrees C) for 20 minutes.",
      "Decrease oven temperature to 350F (175 degrees C) and bake for 20 minutes more.",
      "Immediately remove from cups and serve piping hot.",
      "I make these all the time.",
      "so I know you'll love these as much as I do :).",
      "I usually eat them all in one day.",
      "haha yes I know that's horrible.."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "milk",
      "eggs",
      "salt",
      "flour",
      "cream",
      "confectioners sugar",
      "vanilla",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "granola supreme",
    "ingredients": [],
    "directions": [
      "Preheat oven to 250 deg.",
      "Grease 2 cookie sheets.",
      "Mix all dry ingredients including fruit in an extra large bowl.",
      "Use Mila brand Chia -- Make a paste:.",
      "In a small bowl mix briskly and well; 3 scoops (6 T) of Mila with 1 cup water.",
      "Set Aside.",
      "If you do not have Mila, you can use regular chia.",
      "NOTE: Mila is best as nutritional value is ensured and seeds are cold fractured open for greater bioavailability of nutrients.",
      "it is not sold in stores, if you wish to it go to: genesispure.com/honolulu.",
      "Mix remaining wet ingredients in a medium bowl.",
      "Pour wet mixture into dry and mix well with clean hands - About 5 minutes of constant mixing for all dry ingredients to be coated.",
      "Spread 1/4 of the mixture onto each cookie sheet.",
      "Bake on center rack at 250 deg for 1 hr and 5 or 10 minutes... gently stirring mixture about 3 times during baking process to ensure even texture.",
      "Granola gets crunchy as it cools.",
      "Repeat with second half of mixture.",
      "Store in airtight container(s).",
      "ENJOY!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "rolled oats",
      "puffed kamut",
      "bran",
      "almonds",
      "walnuts",
      "sunflower seeds",
      "unsweetened coconut",
      "raisins",
      "cherries",
      "salt",
      "cinnamon",
      "nutmeg",
      "clove",
      "ginger",
      "brown sugar",
      "maple syrup",
      "molasses",
      "honey",
      "vegetable oil",
      "extra virgin coconut oil",
      "vanilla",
      "butter",
      "natural-style peanut butter",
      "chia seeds",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "penne with grilled eggplant and zucchini",
    "ingredients": [],
    "directions": [
      "Fill a large pot with water and place over high heat to boil.",
      "Preheat the grill or a grill pan over medium-high heat.",
      "Trim ends off eggplant.",
      "Slice in half then into 3/4 strips lengthwise.",
      "Place in a colander in the sink, toss with salt and let sit for about 10 minutes.",
      "While eggplant is sitting, trim the ends off your zucchini and cut each one into thirds, lengthwise.",
      "After 10 minutes, rinse eggplant and pat dry with a paper towel.",
      "Toss eggplant and zucchini strips with 1 tablespoon olive oil.",
      "Place on the grill or grill pan and cook for 8 minutes, turning once halfway through.",
      "You might have to work in two batches.",
      "While vegetables are on the grill, boil your penne according to package directions.",
      "Place grilled eggplant and zucchini onto a cutting board to cool.",
      "Chop tomato and grilled eggplant and zucchini into 3/4 chunks.",
      "Drain pasta and pour it back into the pot.",
      "Toss with eggplant, zucchini, tomato, basil, chicken and feta.",
      "Season with salt and pepper to taste.",
      "Enjoy!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Eggplant",
      "Salt",
      "Zucchini",
      "Olive Oil",
      "Tomato",
      "Fresh Basil",
      "Chicken",
      "Feta Cheese",
      "Salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "easy olive spread",
    "ingredients": [],
    "directions": [
      "Mix cream cheese spread and olives; cover.",
      "Refrigerate 1 hour.",
      "Serve as a spread with the crackers."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "PHILADELPHIA Cream Cheese",
      "green olives",
      "Crackers",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "southern baked beans",
    "ingredients": [],
    "directions": [
      "Preheat oven to 325 degrees.",
      "Fry bacon until crisp; crumble.",
      "In bacon drippings, saute onion until brown.",
      "Mix bacon, onion, and drippings with remaining ingredients.",
      "Pour into casserole dish and bake covered for 45 to 60 minutes."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "bacon",
      "onion",
      "pork",
      "yellow mustard",
      "maple",
      "ketchup",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pasta with tomato sauce provencal",
    "ingredients": [],
    "directions": [
      "Plunge fresh tomatoes into boiling water for a few seconds and remove skins.",
      "Chop pulp coarsely if using fresh tomatoes.",
      "Heat oil in heavy pot; add onions and cook until transparent.",
      "Add remaining ingredients and simmer 1 1/2 to 2 hours, stirring occasionally.",
      "Break up tomatoes as they cook.",
      "Remove parsley, bay leaf and orange peel.",
      "Freeze.",
      "To serve, reheat, correct seasonings and serve over spaghetti or spaghetti squash.",
      "Allow 2 to 3 ounces dried spaghetti per person."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "tomatoes",
      "olive oil",
      "onion",
      "garlic",
      "orange peel",
      "parsley",
      "bay leaf",
      "thyme",
      "fennel seeds",
      "fresh basil leaf",
      "coriander",
      "Freshly ground black pepper",
      "celery",
      "tomato paste",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "strawberry mousse",
    "ingredients": [],
    "directions": [
      "Mix all ingredients in blender and freeze.",
      "Serve in sherbert glasses garnished with a sprig of mint or lemon balm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "nonfat yogurt",
      "sugar",
      "vanilla",
      "lemon juice",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "can't wait tailgate bbq tacos recipe alender",
    "ingredients": [],
    "directions": [
      "combine the first 8 ingredients in a large bowl.",
      "Toss to mix well.",
      "Fill taco shells (or tortillas, if used, adding a tblsp of cheese and rolling )",
      "Top with a heaping tablespoon of cheese.",
      "Add more KC Masterpiece to garnish if desired."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "angelhair",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cranberry and apricot chutney",
    "ingredients": [],
    "directions": [
      "In a heavy large saucepan combine granulated sugar and water.",
      "Cook and stir over medium-high heat until sugar is dissolved.",
      "Bring to boiling without stirring.",
      "Stir in berries, apricots, vinegar, brown sugar and ginger; reduce heat.",
      "Simmer uncovered for 5 min or until berries have popped and mixture starts to thicken.",
      "Remove from heat; cool.",
      "Cover and chill up to 4 days.",
      "Before serving, let stand at room temp for 30 min.",
      "Makes about 3 1/2 cups or 14 (1/4 cup) servings.",
      "106 cal per serving"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "sugar",
      "water",
      "cranberries",
      "apricots",
      "vinegar",
      "brown sugar",
      "fresh ginger",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pickled jalapenos recipe",
    "ingredients": [],
    "directions": [
      "Combine all ingredients in a nonreactive 2-quart saucepan over medium heat.",
      "Bring to a simmer and cook until jalapenos are very soft, about 25 minutes.",
      "Remove from heat and allow to steep for 30 minutes; remove bay leaves.",
      "Can jalapenos in sterile quart-size jars or place in plastic containers in the refrigerator.",
      "Try to resist eating them and store for 2 weeks before using so the flavors develop well."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "jalapenos",
      "carrots",
      "crab boil spice mix",
      "cider vinegar",
      "whole black peppercorns",
      "bay leaves",
      "kosher salt",
      "garlic",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "lemon zest muffins (gluten free)",
    "ingredients": [],
    "directions": [
      "Preheat oven to 180 degrees C or 160 degrees fan forced and grease or line a standard 12 cup muffin tray.",
      "In a large bowl, combine flour, xanthan, sugar, baking powder and soda, and salt.",
      "Use a whisk to blend the dry ingredients thoroughly.",
      "In another bowl, combine the yogurt with the egg, applesauce or margarine, lemon zest and lemon juice.",
      "Whisk the mixture until smooth and well blended.",
      "Blend the wet mixture into the dry ingredients just until blended and all ingredients are moistened.",
      "Fill muffin cups about 2/3 full and sprinkle with additional zest and sugar if desired.",
      "Bake for 18-20 minutes, or until browned and a toothpick comes out clean when inserted into the centre of a muffin.",
      "Cool muffins in the pan (set on a rack) for 5 minutes before removing them from the pan to a cooling rack."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Flour",
      "Xanthan Gum",
      "Sugar",
      "Baking Powder",
      "Baking Soda",
      "Salt",
      "Sour Cream",
      "Egg",
      "Margarine",
      "Lemon Zest",
      "Lemon Juice",
      "Sugar",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pasta with chianti and tomatoes",
    "ingredients": [],
    "directions": [
      "Using a paring knife cut the tomatoes lengthwise all the way around.",
      "Pull the tomato halves apart.",
      "Squeeze each half of the tomato into a saute pan to get out all the juices.",
      "Cut the skins into 1/4-inch strips and toss them into the saucepan as well.",
      "Add the olive oil and salt and cook the tomatoes over high heat for about 15 minutes.",
      "Mince the garlic and add it as well.",
      "By this time the tomatoes should be soft and their juices should be bubbling.",
      "Add the Chianti and cook for an additional 5 minutes or so, just until most of the liquid has evaporated.",
      "Take the sauce off the heat and add the basil.",
      "Cook the pasta in a pot of boiling, salted water according to package instructions for al dente.",
      "Depending on whether or not you have fresh pasta, this could take anywhere from 2 to 8 minutes.",
      "Once the pasta is done, use a pasta fork to remove it from the pasta water and transfer it to the sauce in the saute pan.",
      "Toss the pasta with the tomatoes and serve with the Pecorino.",
      "Enjoy!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Tomatoes",
      "Olive Oil",
      "Salt",
      "clove Garlic",
      "Chianti",
      "Basil",
      "Pecorino Cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "boston banana brown bread",
    "ingredients": [],
    "directions": [
      "Combine the flour, cormeal, baking soda, and nutmeg, and stir to mix well.",
      "Add the banana, buttermilk, and molasses, and stir just until the dry ingredients are moistened.",
      "Fold in the dates.",
      "Coat 4 one-pound cans with nonstick cooking spray.",
      "Divide the batter among the cans, and bake at 300F for about 40 minutes, or just until a wooden toothpick inserted in the center of a loaf comes out clean.",
      "Remove the bread from oven and let sit for 10 minutes.",
      "Invert the loaves onto a wire rack, turn right side up, and cool before slicing and serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "whole wheat flour",
      "whole grain cornmeal",
      "baking soda",
      "ground nutmeg",
      "very ripe bananas",
      "nonfat buttermilk",
      "molasses",
      "dates",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chicken breast + shio-koji + olive oil cooked in the microwave",
    "ingredients": [],
    "directions": [
      "Spread the chicken breast on a microwave-safe plate, and rub the shio-koji and olive in very well.",
      "When you are in a hurry you can just cook the chicken as-is, but if possible leave it to marinate in the refrigerator for more than 6 hours.",
      "The longer you let it rest in the marinade, the more its flavor and texture will improve.",
      "You can leave it to marinate topped with bay leaves and so on if you like.",
      "Cover the plate tightly with plastic wrap, and microwave for 6 minute s at 600w.",
      "The plastic wrap will rip and the chicken will become slightly browned.",
      "Leave it as-is to cool and rest for about 20 minutes if possible.",
      "This will settle the juices in the chicken.",
      "You can eat microwaved chicken even when it's cold.",
      "You can slice it the next day too.",
      "It can be warmed up a bit in the microwave just before eating.",
      "Slice thinly or thickly as you like.",
      "Use the leftover juices to pour over the chicken or use as a dipping sauce."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Chicken",
      "koji",
      "Olive oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "lamb-and-apricot tagine with almond couscous",
    "ingredients": [],
    "directions": [
      "Make the Tagine Score an X on the bottom of each tomato.",
      "In a large pot of boiling water, blanch the tomatoes just until the skins shrivel, about 30 seconds.",
      "Remove the tomatoes and let cool slightly, then peel and finely chop.",
      "Make the Tagine In a large enameled cast-iron casserole, heat the olive oil.",
      "Season the lamb shanks with salt and pepper and cook over moderately high heat, turning, until golden brown all over, about 5 minutes.",
      "Transfer the lamb to a baking sheet.",
      "Make the Tagine Add the onion, carrots, garlic, ginger, cumin, turmeric and cinnamon sticks to the pot and cook over moderate heat, stirring, until the onion is golden and softened, about 8 minutes.",
      "Add the lamb shanks and wine.",
      "Bring to a simmer and cook for 3 minutes.",
      "Add the tomatoes, stock, parsley and cilantro and return to a simmer.",
      "Cover and cook gently until the lamb is almost tender, about 1 1/2 hours.",
      "Add the apricots and honey to the tagine and cook until the lamb is very tender, about 30 minutes longer.",
      "Discard the cinnamon sticks.",
      "Stir in the chickpeas and season with salt and pepper.'",
      "Meanwhile, Make the Couscous Put the couscous in a large heatproof bowl.",
      "In a medium saucepan, bring the stock to a simmer and season with salt and pepper.",
      "Pour the hot stock over the couscous and stir well.",
      "Cover with plastic wrap and let stand until all the stock has been absorbed and the couscous is tender, about 30 minutes.",
      "Fluff the couscous with a fork and stir in the almonds and parsley.",
      "Meanwhile, Make the Couscous Sprinkle the lamb tagine with cilantro and serve with the couscous."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "tomatoes",
      "extra-virgin olive oil",
      "lamb shanks",
      "Kosher salt",
      "Pepper",
      "onion",
      "carrots",
      "garlic",
      "ground ginger",
      "ground cumin",
      "ground turmeric",
      "cinnamon",
      "red wine",
      "chicken stock",
      "parsley",
      "cilantro",
      "apricots",
      "honey",
      "chickpeas",
      "couscous",
      "chicken stock",
      "Kosher salt",
      "Pepper",
      "almonds",
      "parsley",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "bread and cheese casserole recipe",
    "ingredients": [],
    "directions": [
      "Preheat oven to 350 degrees.",
      "Toast and cut the bread into smaller pcs.",
      "In a 9x13 pan, put a layer of bread, onions, green pepper, tomatoes and cheese.",
      "Salt and pepper to taste and sprinkle Parmesan cheese over all.",
      "Dot with butter.",
      "Heat the lowfat milk and beat in Large eggs.",
      "Pour mix over casserole.",
      "Bake for 40 min or possibly till lowfat milk has absorbed and cheese is melted and bubbly.",
      "Makes 3 servings"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Bread",
      "Grated cheese",
      "Onions",
      "Green peppers",
      "Tomatoes",
      "Butter",
      "milk",
      "Parmesan cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "honey butter split top whole wheat bread recipe",
    "ingredients": [],
    "directions": [
      "Mix whole wheat flour, 1/3 c. honey, shortening, salt and yeast in 4-qt bowl; add in hot water.",
      "Beat on low speed, scraping bowl frequently, 1 minute.",
      "Repeat, mixing on medium speed for 1 minute.",
      "Stir in sufficient flour, 1 c. at a time, to make dough easy to handle.",
      "Turn dough onto lightly floured surface; knead till smooth and elastic, about 10 min.",
      "Place in greased 2 1/2 qt bowl; turn greased side up.",
      "Cover and let rise in hot place till double, 40 to 60 min.",
      "(Dough is ready if indentation remains when touched).",
      "Punch down dough; divide into halves.",
      "Let rest 5 min.",
      "Flatten each half with hands or possibly rolling pin into rectangle, 18 x 9 inches on lightly floured surface.",
      "(If dough shrinks, gently stretch into rectangle).",
      "Fold 9 inch sides crosswise into thirds, overlapping sides.",
      "Roll up tightly toward you, beginning at open end.",
      "Healthy pinch edge of dough into roll to seal well.",
      "Press each end with side of hand to seal; fold ends under loaf.",
      "Place loaves, seam sides down, in 2 greased loaf pans, 9 x 5 x 3 inches Or possibly 8 1/2 x 4 1/2 x 2 1/2 inches.",
      "brush loaves lightly with butter and sprinkle with crushed oats or possibly whole wheat flour if you like.",
      "Let rise till double, 35 to 50 min.",
      "Use a slightly sharp knife to cut a 3/4 inch slit down the middle of the loaf (longwise).",
      "Pour in melted butter mixed with rest of honey.",
      "Bake at 375 degrees on low rack so which bread tops are in center of oven, 40-45 min."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "stone-grnd",
      "honey",
      "shortening",
      "salt",
      "yeast",
      "very hot water",
      "all-purpose",
      "butter",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "8-minute hard-boiled eggs",
    "ingredients": [],
    "directions": [
      "Bring a pot of water to a boil.",
      "Slowly and carefully add in the eggs.",
      "Set the timer for 8 minutes.",
      "After 8 minutes, remove the eggs with a slotted spoon and place into a bowl of iced water.",
      "Let them sit in the iced water for a minute or so before removing and cracking into the egg.",
      "My mistake in the past was never knowing when my water was coming to a boil, as I typically walked away from the stove and simply guessed the length of time it would take to come to a boil.",
      "This technique is much more precise as you boil the water beforehand, resulting in a a perfect hard-boiled egg, and one where the shell simply slides off.",
      "A win-win in my book.",
      "Once the shell is off, season with salt and pepper and go to town.",
      "If you are looking for a perfect egg, give this one a shot.",
      "Im certain you will fall in love."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Eggs",
      "Water",
      "Water",
      "Salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "ham florentine mini cups",
    "ingredients": [],
    "directions": [
      "Heat oven to 375F In medium bowl, mix all ingredients except rolls, ham and Parmesan cheese until well blended.",
      "Set aside.",
      "Unroll dough; separate into 4 rectangles.",
      "Firmly press perforations to seal.",
      "Cut each rectangle into 6 (2-inch) squares.",
      "Press 1 square in bottom and up side of each of 24 ungreased mini muffin cups.",
      "Pat each ham slice dry with paper towel.",
      "Place 1 ham slice over dough in each cup (edges of ham will be higher than side of cup.)",
      "Spoon rounded 1 teaspoon spinach mixture onto ham in center of each cup.",
      "Bake 14 to 18 minutes or until crust is golden brown and filling is hot.",
      "To prevent excessive browning of ham, cover lightly with foil after first 5 minutes of baking.",
      "Cool in pan 1 minute.",
      "Gently remove from pan; let stand 3 minutes.",
      "Sprinkle lightly with Parmesan cheese before serving if desired and serve warm."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "garlic",
      "mozzarella cheese",
      "five-cheese",
      "romano cheese",
      "onions",
      "garlic",
      "salt",
      "pepper",
      "rolls",
      "ham",
      "parmesan cheese",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "armadillo eggs",
    "ingredients": [],
    "directions": [
      "Cut the stems off jalapeno peppers, slice in half length-wise and remove the insides.",
      "(I recommend using gloves for this so you dont burn your fingers!)",
      "If you want more heat, you can leave the insides.",
      "Mix the sausage, baking mix and shredded cheddar until thoroughly combined.",
      "(Its easier to do with your hands.)",
      "Place one or two cubes of monterrey jack on each of the jalapeno halves (make the size of the cubes depending upon size of jalapeno) and then take sausage mixture and wrap/mold it around the jalapeno/cheese until it is encased.",
      "Repeat with remaining ingredients.",
      "Bake at 350 degrees (F) on a lightly-greased baking sheet for about 20-25 minutes until golden brown.",
      "This is super versatile!",
      "If you like heat, take a whole jalapeno and just cut a slit in it and stuff the cheese and then wrap with the sausage mixture.",
      "Enjoy!",
      "!"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "Peppers",
      "Sausage",
      "Bisquick",
      "Cheddar",
      "weight Monterey",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "heirloom tomato gazpacho",
    "ingredients": [],
    "directions": [
      "make the mousse:",
      "in the food processor add the avocado and blend with the lemon juice and salt to taste.",
      "fold the pureed avocado into the whipped cream.",
      "for the gazpacho:",
      "take the first 6 ingredients and rough chop them all together.",
      "place them in a plastic container with the olive oil, sherry vinegar, tomato paste, salt and pepper.",
      "marinate overnight.",
      "the next day process the gazpacho in a food processor, it should be smooth enough so it is a soup like consistancy but still with a chunky texture.",
      "After the soup is blended stir in vegetable stock and season again with salt and pepper.",
      "to garnish:",
      "cut heirloom tomatoes into wedges and place them in a spiral in the center of the bowl to serve.",
      "place a dollop of avocado mousse in the center."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "avocado",
      "lemon juice",
      "heavy cream",
      "green zebra tomatoes",
      "European cucumber",
      "yellow pepper",
      "celery",
      "Italian parsley",
      "peppers",
      "extra virgin olive oil",
      "sherry wine vinegar",
      "tomato paste",
      "salt",
      "fresh black pepper",
      "vegetable stock",
      "tomato",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "breakfast enchiladas",
    "ingredients": [],
    "directions": [
      "Preheat oven to 350.",
      "Cook sausage in a large nonstick skillet over medium-high heat, stirring until sausage crumbles are cooked through.",
      "Remove from pan; drain well.",
      "Set aside.",
      "PREPARECHEESE SAUCE",
      "Melt butter in a heavy saucepan over medium-low heat; whisk in flour until smooth.",
      "Cook, whisking constantly, 1 minute.",
      "Gradually whisk in milk; cook over medium heat, whisking constantly, 5 minutes or until thickened.",
      "Remove from heat, and whisk in remaining ingredients.",
      "Set aside.",
      "ENCHILADA FILLING",
      "Melt butter in a large nonstick skillet over medium heat.",
      "Add green onions and cilantro, and saute 1 minute.",
      "Add eggs, salt, pepper, and cook, without stirring, until eggs begin to set on bottom.",
      "Draw a spatula across bottom of pan to form large curds.",
      "Continue to cook until eggs are thickened but still moist; do not stir constantly.",
      "Remove from heat, and gently fold in 1 1/2 cups Cheese Sauce and sausage.",
      "Spoon about 1/2 cup egg mixture along the bottom of each tortilla; roll up tightly.",
      "Place, seam side down, in a lightly greased 13-x 9-inch baking dish.",
      "Pour remaining Cheese Sauce evenly over tortillas; sprinkle evenly with pepper Jack cheese.",
      "Bake at 350 for 25-30 minutes or until sauce is bubbly.",
      "When enchiladas are done; sprinkle down the center in this order; 1/2 pd crumbled sausage, halved grape tomatoes, green onions and fresh cilantro."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "ENCHILADA",
      "hot ground pork sausage",
      "butter",
      "green onions",
      "fresh cilantro",
      "eggs",
      "salt",
      "black pepper",
      "flour tortillas",
      "butter",
      "flour",
      "milk",
      "cheddar cheese",
      "green chiles",
      "salt",
      "TOPPINGS",
      "pepper",
      "sausage",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "latin-spiced rib eye with sauteed onions and cilantro",
    "ingredients": [],
    "directions": [
      "In a small bowl, combine the cumin, oregano and garlic and onion powders, 1 teaspoon of salt and 1/2 teaspoon of pepper.",
      "Season the steaks on both sides with the spice mixture and rub them with the garlic puree.",
      "In a large skillet, heat 1 tablespoon of the olive oil.",
      "Add 4 of the steaks and cook over high heat until browned, 1 minute per side; transfer to a plate.",
      "Repeat with the remaining olive oil and meat.",
      "Reduce the heat to moderate and add the onions to the skillet, stirring until coated with oil.",
      "Cover and cook until just softened, about 5 minutes, stirring halfway through.",
      "Transfer the onions to a shallow bowl and cover with foil.",
      "Add the stock to the skillet and simmer over moderately high heat for 1 minute, scraping up any browned bits from the bottom of the pan with a wooden spoon.",
      "Stir in the vinegar and butter and cook until the butter is completely melted and blended into the sauce.",
      "Return the meat, any accumulated juices and the onions to the skillet and turn to coat and heat through.",
      "Transfer to plates, top with the cilantro and serve."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "ground cumin",
      "oregano",
      "garlic",
      "onion powder",
      "Kosher salt",
      "garlic",
      "extra-virgin olive oil",
      "sweet onions",
      "tenderloin",
      "beef stock",
      "white vinegar",
      "unsalted butter",
      "cilantro",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "chocolate crumble",
    "ingredients": [],
    "directions": [
      "Heat the oven to 375F or 350F on convection.",
      "Line a baking sheet with a Silpat or parchment.",
      "Cut the butter into pieces and put it in the bowl of a standing mixer fitted with the paddle.",
      "Whisk the cocoa powder, flour, sugar, and salt together and add to the bowl.",
      "Mix at medium speed until well combined, dark brown, and in big crumbs.",
      "Spread out on the baking sheet, breaking up the biggest crumbs and leaving room for spreading.",
      "Bake until crisp, about 20 minutes, rotating the pan halfway through baking.",
      "Let cool.",
      "When the crumble is cool, put it in a food processor and process to fine, even crumbs.",
      "Store in an airtight container for up to 1 week."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "unsalted butter",
      "cocoa",
      "flour",
      "sugar",
      "salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cran-apple white chocolate popcorn",
    "ingredients": [],
    "directions": [
      "Melt chocolate in large bowl set over pot of simmering water, stirring frequently until smooth.",
      "Add cinnamon and pumpkin pie spice and whisk to combine.",
      "Add popcorn and toss using two wooden spoons until well coated, about 30 seconds.",
      "Add apples and cranberries and stir to combine.",
      "Transfer mixture to to a parchment paper-lined rimmed baking sheet, using back of spoon to spread evenly over entire surface.",
      "Chill in refrigerator for at least one hour.",
      "Using hands, break into small pieces and serve.",
      "Store for up to 3 days in covered container."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chocolate chips",
      "ground cinnamon",
      "ground pumpkin pie spice",
      "popcorn",
      "apple",
      "cranberries",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cucumber sandwiches",
    "ingredients": [],
    "directions": [
      "Prepare ahead",
      "Step 1 can be completed 1 hour in advance, and the cucumber slices stored in the refrigerator.",
      "Using a sharp knife, carefully slice the cucumber into rounds, no thicker than 1/8 in (2mm).",
      "Place the cucumber slices in a colander and sprinkle with the salt.",
      "Let stand for 20-30 minutes to allow the excess liquid to drain off.",
      "When ready to use, sprinkle the slices with the vinegar.",
      "Spread each slice of bread with some softened butter.",
      "Arrange the cucumber slices in an even layer over 4 slices of bread.",
      "Season with pepper, then top with the remaining bread slices, buttered sides down.",
      "Cut off the crusts from each sandwich, then cut each sandwich into squares, triangles, or rectangles.",
      "Arrange the sandwiches on a serving plate.",
      "Sprinkle with watercress, and serve at once.",
      "Variation",
      "Cheese and Cucumber Sandwiches",
      "As an alternative to butter, spread the bread with cream cheese or soft goat cheese."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "cucumber",
      "salt",
      "white wine vinegar",
      "bread",
      "butter",
      "Freshly ground black pepper",
      "watercress leaves",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "simple corn bread (with variations)",
    "ingredients": [],
    "directions": [
      "Mix all the dry ingredients in a large mixing bowl, thoroughly blend together, and set aside.",
      "Scald the cream with the butter, add to the ingredients.",
      "Mix in eggs.",
      "Pour into a greased and floured 13 inch x 9 inch pan.",
      "Bake at 350 degrees (175 C.) for 30 minutes.",
      "Allow to stand for several minutes before cutting and serving."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "biscuit mix",
      "butter",
      "cream",
      "yellow cornmeal",
      "baking soda",
      "salt",
      "sugar",
      "eggs",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "sweet apple pops",
    "ingredients": [],
    "directions": [
      "In a medium saucepan, bring the apple juice, sugar, lemon juice, salt, ginger, cinnamon stick and allspice berries to a boil over medium heat.",
      "Remove the pan from the heat and let the mixture stand for 15 minutes.",
      "Strain the mixture into a large measuring cup.",
      "Pour the mixture into ice pop molds.",
      "Insert the stick/cover tops and freeze until solid, about 6 hours.",
      "Run cold water over the sides of the molds to loosen the ice pops and serve immediately"
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "apple juice",
      "dark brown sugar",
      "lemon juice",
      "kosher salt",
      "berries",
      "cinnamon",
      "ginger",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "baked praline ice cream cake",
    "ingredients": [],
    "directions": [
      "Set oven to 350 degrees /Grease a 13\" x 9\" baking pan /In a saucepan, combine the brown sugar, sour cream, 2 tbsp butter and cornstarch /Cook, and stir over medium heat until mixture comes to a boil.",
      "/Remove from heat.",
      "/Stir in 1 tsp vanilla; set aside.",
      "/Melt the remaining butter; place in a mixing bowl.",
      "/Add icecream; stir to blend.",
      "/Add eggs, one at a time, beating well after each addition; stir in the remaining 1 tsp vanilla.",
      "/In a bowl, combine the flour, cracker crumbs, sugar.",
      "baking powder and salt; gradually add to icecream mixture until combined.",
      "/Pour into prepared baking pan.",
      "/Drizzle with half of the praline sauce.",
      "/Bake for 25-30 minutes, or until cake tests done.",
      "/Cool on wire rack.",
      "/Add pecans to remaining sauce; spoon over warm cake (the sauce will not cover entire cake).",
      "/Cool in pan, serve with whipped cream."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "brown sugar",
      "sour cream",
      "butter",
      "butter",
      "cornstarch",
      "vanilla",
      "vanilla ice cream",
      "eggs",
      "flour",
      "graham cracker crumbs",
      "sugar",
      "baking powder",
      "salt",
      "pecans",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "weeknight lasagna toss",
    "ingredients": [],
    "directions": [
      "Brown meat in large saucepan; drain.",
      "Add next 5 ingredients; bring to boil.",
      "Stir in noodles; cover.",
      "Cook on medium-low heat 10 to 15 min.",
      "or until noodles are tender, stirring occasionally.",
      "Remove from heat.",
      "Top with cheese; let stand, covered, 5 min.",
      "or until melted."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "lean ground beef",
      "green peppers",
      "garlic",
      "spaghetti sauce",
      "water",
      "Italian Dressing",
      "lasagna noodles",
      "Italian",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "roasted garlicpea puree on sourdough croutes",
    "ingredients": [],
    "directions": [
      "Preheat oven to 400F.",
      "Diagonally cut twenty-four 1/4-inch-thick slices from baguette with a serrated knife and arrange in one layer on a large baking sheet.",
      "Lightly brush tops of slices with about 1 tablespoon oil total and season with salt and pepper.",
      "Bake slices in middle of oven 5 minutes, or until golden, and transfer to a rack to cool.",
      "Separate garlic heads into cloves, discarding loose papery outer skin but keeping skin on cloves intact, and wrap together in foil, crimping seams to seal tightly.",
      "Roast garlic in middle of oven 30 minutes, or until soft.",
      "Unwrap garlic and cool slightly.",
      "Peel skin from each clove.",
      "Finely grate enough Parmigiano-Reggiano to measure 1/4 cup and chill remainder, wrapped in plastic wrap.",
      "In a saucepan cook peas in water, stirring, until just tender and heated through.",
      "In a food processor puree warm peas, garlic, grated cheese, lemon juice, 1 tablespoon oil, and salt and pepper to taste until smooth.",
      "Transfer puree to a bowl and cool completely.",
      "Puree may be made 1 day ahead and chilled, covered.",
      "Bring puree to room temperature before using and season with salt and pepper.",
      "With a vegetable peeler shave 24 thin slices from chilled Parmigiano-Reggiano.",
      "Spread about 1 heaping tablespoon puree on each toast and top with an arugula leaf and a Parmigiano-Reggiano shaving.",
      "Serve toasts drizzled with remaining oil."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "baguette",
      "extra-virgin olive oil",
      "garlic",
      "frozen peas",
      "water",
      "lemon juice",
      "arugula",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pumpkin bars with cream cheese icing",
    "ingredients": [],
    "directions": [
      "Preheat oven to 350 degrees F (175 degrees C).",
      "Grease a 12x18 inch half sheet pan.",
      "In a large bowl, using a wooden spoon, mix together the eggs, oil, sugar and pumpkin until well blended.",
      "Combine the flour, baking powder, baking soda, salt, cinnamon, ginger, cloves and nutmeg; stir into the pumpkin mixture until just blended.",
      "Spread evenly into the prepared pan.",
      "Bake for 25 to 30 minutes in the preheated oven, until bars spring back when lightly touched.",
      "Cool before cutting into bars.",
      "To make the frosting In a large bowl, beat cream cheese and sugar until smooth.",
      "Fold in whipped topping.",
      "Option: Add chopped walnuts on the top as a garnish."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "eggs",
      "vegetable oil",
      "white sugar",
      "pumpkin puree",
      "flour",
      "baking powder",
      "baking soda",
      "salt",
      "ground cinnamon",
      "ground ginger",
      "ground cloves",
      "ground nutmeg",
      "cream cheese",
      "sugar",
      "frozen whipped topping",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "basil chicken parmigiana",
    "ingredients": [],
    "directions": [
      "Prepare pasta according to package directions.",
      "Cut each chicken breast into 2 pieces.",
      "Place between 2 sheets of heavy-duty plastic wrap; flatten to 1/4 inch thickness.",
      "Combine breadcrumbs and 1/4 cup parmesan.",
      "Dip chicken in egg substitute, and dredge in breadcrumb mixture.",
      "Brown chicken in batches, in hot oil in a large skillet, 1 to 2 minutes on each side.",
      "Remove chicken from skillet.",
      "Stir together pasta sauce and basil; spoon half of sauce into baking dish.",
      "Arrange chicken in an even layer over sauce; pour remaining sauce over chicken.",
      "Sprinkle evenly with mozzarella cheese and remaining 1/4 cup parmesan.",
      "Bake at 350 for 20 minutes or until mozzarella cheese is lightly browned and sauce is bubbly around edges.",
      "Remove from oven and sprinkle with parsley.",
      "Serve chicken over hot cooked pasta."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "rotini pasta",
      "chicken breasts",
      "Italian breadcrumbs",
      "parmesan cheese",
      "egg substitute",
      "olive oil",
      "pasta sauce",
      "fresh basil",
      "mozzarella cheese",
      "fresh Italian parsley",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "cheese-and-salmon quesadilla",
    "ingredients": [],
    "directions": [
      "In a bowl, stir together two 6-oz.",
      "cans salmon (drained) and 1/2 cup shredded Monterey Jack cheese.",
      "Divide salmon filling among four 8-inch flour tortillas, covering half.",
      "Top with 1/3 cup chopped roasted green chilies and another 1/2 cup cheese; fold tortillas over filling.",
      "Cook quesadillas (2 at a time) in a skillet misted with cooking spray over medium heat until tortillas are golden and cheese is melted, about 2 minutes per side 4.",
      "Cut into wedges and serve with sour cream and guacamole."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "salmon",
      "cheese",
      "flour tortilla",
      "green chillies",
      "sour cream",
      "guacamole",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "mozzarella meatball sandwiches",
    "ingredients": [],
    "directions": [
      "Heat the oven to 400F.",
      "Remove the bread from the bag.",
      "Place the frozen bread halves, cut side up, on an ungreased baking sheet.",
      "(if the bread halves are frozen together, carefully insert a fork between halves to separate).",
      "Place baking sheet on the middle oven rack.",
      "Bake for 20 minutes or until it's hot.",
      "Heat the sauce and meatballs in a 2-quart saucepan over low heat.",
      "Cook and stir for 20 minutes or until the meatballs are heated through.",
      "Place the meatballs onto the bottom bread half.",
      "Top with the remaining bread half.",
      "Cut into quarters."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "bread",
      "Italian sauce",
      "frozen meatballs",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "curried asparagus vichyssoise",
    "ingredients": [],
    "directions": [
      "Cook the onion in butter in a medium saucepan over low heat for around 6 minutes, stirring occasionally.",
      "Add curry powder and cook for 2 more minutes, stirring frequently.",
      "Add the carrots, potatoes, asparagus, soy sauce, coconut milk and broth to the pan.",
      "The liquid should barely cover the vegetables, so add or subtract broth if necessary.",
      "Bring to the boiling point, then turn down the heat to low.",
      "Cover the pan and simmer for around 45 minutes until the carrots and potatoes are soft.",
      "In batches, puree the soup in a blender.",
      "Next, pour it through a strainer into a bowl to remove all lumps remaining.",
      "Taste the soup for seasoning, adding salt and pepper to your taste preference.",
      "Chill the soup in the refrigerator for at least 3 hours.",
      "Taste soup again, since chilling often reduces the flavor impact.",
      "Pour into 4 shallow bowls.",
      "Spoon 1/4 cup crab meat into the center of each bowl and sprinkle with some sliced green onions."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "sweet onion",
      "butter",
      "curry powder",
      "carrot",
      "red potatoes",
      "then",
      "coconut milk",
      "vegetable broth",
      "soy sauce",
      "green onion",
      "crabmeat",
      "salt",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "sunny's fake crepes",
    "ingredients": [],
    "directions": [
      "Spread hazelnut spread on 1 side of each tortilla.",
      "In a large pan over medium heat add 2 tablespoons of butter and let it melt until bubbly.",
      "Add 2 of the tortillas with the chocolate hazelnut spread side facing up.",
      "Using an imaginary line add 1/3 cup of marshmallows down 1 half of each tortilla, making sure to keep them in a single layer.",
      "Allow the tortilla to slightly bubble on the pan and check underneath for a golden, toasted color.",
      "Fold the tortilla over to form a half circle and slightly press down to seal.",
      "Cook until marshmallows start to melt but don't lose their shape.",
      "Transfer them to a cutting board.",
      "Repeat with the remaining tortillas.",
      "Meanwhile, put the hazelnuts on a plate.",
      "Cut the tortillas in half, then quickly press the opened sides into the chopped hazelnuts.",
      "Arrange them on a serving platter and serve immediately."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "chocolate hazelnut spread",
      "tortillas",
      "butter",
      "marshmallows",
      "hazelnuts",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "devil eggs",
    "ingredients": [],
    "directions": [
      "Boil eggs on medium for 30mins.",
      "Then cool eggs down in cold water for approximately 5 mins.",
      "Crack the eggs shells, then split them down the middle, lengthwise.Remove yolk halves placing them in a bowl.",
      "Then take a folk and mash the egg yolk.",
      "Next add all the ingredients to the bowl with the egg yolk.",
      "The next step is to add egg yolk mixture into the egg halves.",
      "finish touch sprinkle paprika on top."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "eggs",
      "paprika",
      "salt",
      "choice",
      "miracle whip",
      "relish",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "extremely easy and quick - namul daikon salad",
    "ingredients": [],
    "directions": [
      "Julienne the daikon and squeeze out the excess moisture.",
      "Combine all of the ingredients.",
      "Serve on a dish."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "radish",
      "Sesame oil",
      "White sesame seeds",
      "Salt",
      "Soy sauce",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "pan-roasted pork chops with apple fritters",
    "ingredients": [],
    "directions": [
      "In a large bowl, mix the apple cider with 4 cups of water, the sugar and the salt.",
      "Toast the bay leaves, chilies, juniper berries, caraway seeds, mustard seeds and coriander seeds in a small pan set over medium heat until you can smell them, then add to the brine, and stir to combine.",
      "Add the pork chops, cover and place in the refrigerator to brine overnight or for up to 48 hours.",
      "To pan-roast the pork chops, preheat oven to 375.",
      "Remove chops from brine, and pat dry with paper towel.",
      "Season the meat aggressively with freshly ground black pepper and a little salt.",
      "Set a large saute pan that will fit in the oven over medium-high heat.",
      "Add the oil, and when it is shimmering, place the chops in the pan.",
      "Cook until well seared on one side, approximately 4 minutes, then turn the chops over, and place pan in the oven to finish, approximately 6 to 8 minutes.",
      "(The internal temperature of the pork, measured at the center of the chop, should be between 140 and 145 for medium rare.)",
      "Remove the meat from the pan, and allow to rest for 5 minutes or so while you make the sauce.",
      "Return the pan to the stovetop, over medium heat, and add the butter, stirring and scraping to incorporate meat drippings, then add the shallots and the thyme.",
      "Cook for approximately 3 minutes, then add the brandy.",
      "Allow the mixture to reduce by half, then add the cream and the stock and reduce again, until the sauce coats the back of a spoon.",
      "Remove the sauce from the heat, and whisk in the mustard and the horseradish.",
      "For the apple fritters, heat the apple cider and the cinnamon stick with a couple of inches of water in a large pot set over high heat.",
      "Add the apple rounds, and blanch for 1 minute, then remove to a towel to dry.",
      "Whisk together the egg and the seltzer until frothy, then gently mix in the flours.",
      "Put the oil in a large pan set over medium-high heat.",
      "When the oil is shimmering, dip the apple rings into the batter, and fry in the oil until golden brown.",
      "Serve the pork chops with a few apple fritters and a heavy drizzle of sauce across the top.",
      "The usual accompaniment is potato-and-horseradish pierogies sauteed in brown butter, though roasted new potatoes with a topping of butter and freshly grated horseradish will answer almost as well."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "apple cider",
      "sugar",
      "kosher salt",
      "bay leaves",
      "arbol",
      "berries",
      "caraway seeds",
      "mustard seeds",
      "coriander seeds",
      "pork chops",
      "Freshly ground black pepper",
      "neutral oil",
      "unsalted butter",
      "shallots",
      "thyme",
      "brandy",
      "heavy cream",
      "pork",
      "grain mustard",
      "horseradish",
      "apple cider",
      "cinnamon",
      "apples",
      "egg",
      "water",
      "rice flour",
      "all-purpose",
      "neutral oil",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  },
  {
    "title": "polpette in spicy tomato sauce",
    "ingredients": [],
    "directions": [
      "Preheat the oven to 350.",
      "In a bowl, mix the veal with the sausage meat, bread crumbs, milk, garlic, chopped parsley, egg whites, tomato paste and 1/2 cup of pecorino; season with salt and pepper.",
      "Roll into 1 1/2-inch meatballs.",
      "Bake the meatballs on a lightly oiled baking sheet for about 30 minutes, until browned and cooked through.",
      "In a large saucepan, season the tomato sauce with the crushed red pepper.",
      "Add the meatballs and simmer until the sauce is slightly thickened, about 8 minutes.",
      "Sprinkle with pecorino cheese and serve."
    ],
    "cuisine": "unknown",
    "diet": "unknown",
    "tags": [
      "ground veal",
      "sausage",
      "bread crumbs",
      "milk",
      "garlic",
      "flat-leaf",
      "egg whites",
      "tomato paste",
      "freshly grated Pecorino Romano cheese",
      "Salt",
      "tomato sauce",
      "red pepper",
      "unknown",
      "unknown"
    ],
    "macro_estimate": {
      "calories": null,
      "protein": null,
      "carbs": null,
      "fat": null
    },
    "cost_estimate": 0.5
  }
]